if (!this["Typist_lesson_data"]) Typist_lesson_data = {};
Typist_lesson_data["?"] = [{course:"?", data:[{kind:"T", lines:["                        Typistへようこそ.", "", "Typist は、キーボードのタッチタイピング（ブラインドタッチ）を学習するた", "めのソフトウェアです。タッチタイピングの基本から少しずつ練習を積み重ね、", "やがてタイピングのエキスパートになるまでのカリキュラムが用意されています。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "ただし、タイプする時にキーの上の指を見ることは避けましょう。これは大変悪", "い習慣で、なかなか上達できません。このプログラムでは、誤ったキーインは画", "面上でそれとわかるように表示します。", "", "あなたがこれまで、目で見てキーを押すという方法でタイプしていたのなら、見", "ないで打つのはちょっと苦労かもしれません。でも、タッチタイピングがこれま", "での方法より遅いとしても、練習をあきらめないで下さい。一度この方法を身に", "つけてしまえば、遥かに速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        対象とするキーボード", "", "これまでにワープロやタイプライタ、パソコンなどを扱ったことのある人なら、", "キーボードと言っても文字の配列の仕方にさまざまなものがあることをご存じで", "しょう。", "", "Typistは、標準のアルファベット入力の上達にもっとも力を注いだカリキュラム", "を提供しています。従って、このカリキュラムに従って学習すれば、多少異なっ", "たキーボードにもすぐに適用できます。", "このカリキュラムは、Typingをワークステーションおよびパソコンで実行するこ", "とを考慮して、標準的な日本語、英語キーボードのキー配列で無理なく練習でき", "ることを確認し、また、多少の改良を加えています。", "", "もちろん、色々な記号の入力をタッチタイピングで行いたい人のために、記号の", "入力用のレッスンも用意しています。また、いわゆるテンキーによる数値入力の", "ために、テンキーのタッチタイピングのコースも用意してあります。", "さらに、かな入力の練習がしたい人は、かな入力コースも選択できます。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、101キーボードの設定で動作しています。", "", "このキーボードでは、改行キーの近くに '[' と ']' が隣り合って配置され、数", "字の '2' とシフトキーで '@' が入力できるはずです。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード", "        -ke     101キーボード", "        -kk     国産パソコンのキーボード", "", "例えば、106キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -kj", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        日本語入力について", "", "Typistに現在用意されているカリキュラムは海外で開発されたものですので、ほ", "とんどのレッスンは英語がベースとなっています。", "", "しかし、タイピングで最も重要な指の位置や指の動かし方は、英語でも日本語で", "も変わりません。Typistで練習したあと、指の動きに注意してタイプするように", "心がければ、日本語の入力もタッチタイピングで行えるようになります。", "特に、ローマ字入力方式で入力している人の場合には、その効果はすぐに現れる", "でしょう。", "", "Typistは、かな入力方式の練習用のレッスンを提供しています。かな入力をマス", "ターしようとしている人は、このレッスンで指づかいの基本を習得することがで", "きるでしょう。"]
}
, {kind:"T", lines:["                        どのコースを選択すべきか", "", "Typingにはさまざまな練習用のコースが用意されています。どれを選択して練習", "したらよいのか、戸惑ってしまうかもしれませんね。", "", "        標準コース  (t1 - t16)          スピードアップ  (s1 - s4)", "        標準ドリル  (u1 - u13)          速習コース      (q1 - q5)", "        集中ドリル  (v1 - v20)          上達コース      (r1 - r14)", "        実戦ドリル  (m1 - m11)          数字入力コース  (n1 - n3)", "        かな入力コース (k1 - k16)       かな実践コース  (j1 - j7)", "", "普通は「標準コース」(Tコース)を選択すれば十分です。", "副教材として「標準ドリル」(Uコース)や、「集中ドリル」(Vコース)をするのも", "良いでしょう。これらが終わったら、「スピードアップ」や「実戦ドリル」に挑", "戦すれば、さらに腕を磨くことができるでしょう。", "簡単にタッチタイピングの概要を身につけたい人は「速習コース」を選択するこ", "ともできますが、時間にゆとりがあるなら「標準」を勧めます。", "また、かな入力の練習用には「かな入力コース」、かな入力による文章の練習用", "に「かな実践コース」が設けられています。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "練習の方法は、レッスンの中でも説明されています。ここでは概略だけを説明し", "ておきましょう。", "", "レッスンでは、画面の中ほどにテキストを１行〜数行表示し、画面の上の方に指", "示を表示します。", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "行末まで打ち終えたら、改行(Return)キーを打ちます。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。"]
}
, {kind:"I", lines:["実際にやってみましょう。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"D", lines:["ffff"]
}
, {kind:"T", lines:["                        スピード練習", "", "練習の方法には、もうひとつ、スピード練習と呼んでいるものがあります。", "前の練習では、表示されたテキストの下の行にタイプして行きましたが、この方", "法では、表示されたテキストの上にタイプして行きます。", "", "タイプ間違いをした時には、音で知らせ、誤った部分を強調表示します。Delete", "キーを使うこともできますが、できれば使わないでどんどん打ち続けて下さい。", "", "この練習では、どのくらい早く正確に入力できたか、を自己採点します。タイプ", "し終わったら、画面の下に毎分に入力できる単語数(語/分:WPM)という形で入力", "スピードが計算されます。また、誤りの数も数えて、総数を表示します。"]
}
, {kind:"I", lines:["実際にやってみましょう。Jは右人差し指、空白は右親指で打ちます。"]
}
, {kind:"P", lines:["fff jjj fjfj"]
}
, {kind:"T", lines:["                        かな入力", "", "Typistでは FEP（フロントエンド・プロセッサ）を利用せずに、かな入力の練習", "ができます。かな入力コースでは、FEPを起動せず、指定されたキーをそのまま", "タイプして下さい。画面にはひらがなが表示されます。", ""]
}
, {kind:"I", lines:["実際にやってみましょう。「は」は Fのキー、「ま」は Jのキーです。"]
}
, {kind:"K", lines:["ははは  ままま"]
}
, {kind:"T", lines:["                        練習履歴データ", "", "ひとつのレッスンを終了すると、その情報はファイルの上に記憶されます。", "UNIXの場合は ~/.typistrc というファイルに、MS-DOSでは $HOME/typist.dat", "というファイルに、どのコースはどのレッスンまで終わったかという情報が記録", "されます。", "ただし、環境変数 TYPDATA にファイルのパスが設定されていれば、そのファイル", "が履歴ファイルとなります。MS-DOSの場合、環境変数 HOME も TYPDATA も設定さ", "れていなければファイルは作成されません。", "", "このファイルに書かれた情報は次回に練習を開始する時にメニューといっしょに", "表示されますので、次のレッスンから練習を開始できます。"]
}
, {kind:"T", lines:["                        練習中の特殊なキー操作", "", "練習の画面が表示されている時、以下のキーで特別な動作が可能です。", "", "        Control-F       その画面の練習をせずに次の画面に移ります。", "", "        Control-L       その時に選択しているレッスンを中止して、", "                        コース選択の画面に戻ります。", "", "        Control-C       Typist を終わりにします。", "", "ただし、あるレッスンの中で Control-F を使うと、そのレッスンは真面目に練習", "して終了したものとは見なされませんので注意して下さい。", "逆に、この機能はレッスンの内容をざっと見るのに便利です。"]
}
, {kind:"T", lines:["                        タイプ後の特殊なキー操作", "", "画面の一番下に「次に進むには何かキーを押して下さい...」と表示されている時", "には、次のキーは特殊な機能キーとして働きます。", "", "        Backspaceキー   あるいは", "        Control-H       その画面の練習内容をもう一度繰り返します。", "                        （練習の後にだけ有効）", "", "        Control-G       間違えた時のクリック音（ビープ音）を出す／出さない", "                        の切り替えを行います。", "", "        ?               簡単なヘルプを表示します。", "", "打ち間違いの有無に関わらず、ある画面の表示内容を何回も繰り返して練習したい", "場合には、Backspaceキーで繰り返し練習が可能です。", "通常は１回しか練習できないスピード練習にも、何度も挑戦できます。"]
}
, {kind:"T", lines:["                        コマンドライン", "", "  Typistを起動する時、コマンドラインにオプションを指定できます。", "", "一般形:  typist [オプション] [lesson]", "", "オプション:", "        -k?     ? でキーボードのタイプを指定します。", "                j: 106キー,  e: 101キー,  k: 国産パソコン", "        -L???   ??? で示されるディレクトリのレッスンデータを使います。", "        -q      間違えた時にクリック音（ビープ音）を出さないようにします。", "        -V      現在のバージョン情報を表示します。", "", "Lesson:", "        練習したいレッスンを直接指定します。例えば", "                typist t5", "        とすると、レッスン t5 をすぐに始められます。"]
}
, {kind:"T", lines:["", "", "  Typist は DECUSのテープのBASIC版を元に、D. Jason Penney氏によって作成さ", "れ、配布されました。この日本語版の元となったものは、uxc.cso.uiuc.edu で配", "布されていた 1991年11月の版です。", "", "  プログラムの日本語への対応、および機能の拡張は荻原によって行われました。", "  レッスン用データの日本語化および内容の誤りの訂正、一部変更はすべて荻原の", "責任において行われております。", "", "  このプログラムとレッスン用データは自由に再配布可能ですが、有償での販売等", "はお断りします。", "", "    1997-05-20    神戸大学大学院 自然科学研究科 荻原剛志", "                  ogihara@seg.kobe-u.ac.jp"]
}
]
, keytype:"e", num:"1"}
, {course:"?", data:[{kind:"T", lines:["                        Typistへようこそ.", "", "Typist は、キーボードのタッチタイピング（ブラインドタッチ）を学習するた", "めのソフトウェアです。タッチタイピングの基本から少しずつ練習を積み重ね、", "やがてタイピングのエキスパートになるまでのカリキュラムが用意されています。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "ただし、タイプする時にキーの上の指を見ることは避けましょう。これは大変悪", "い習慣で、なかなか上達できません。このプログラムでは、誤ったキーインは画", "面上でそれとわかるように表示します。", "", "あなたがこれまで、目で見てキーを押すという方法でタイプしていたのなら、見", "ないで打つのはちょっと苦労かもしれません。でも、タッチタイピングがこれま", "での方法より遅いとしても、練習をあきらめないで下さい。一度この方法を身に", "つけてしまえば、遥かに速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        対象とするキーボード", "", "これまでにワープロやタイプライタ、パソコンなどを扱ったことのある人なら、", "キーボードと言っても文字の配列の仕方にさまざまなものがあることをご存じで", "しょう。", "", "Typistは、標準のアルファベット入力の上達にもっとも力を注いだカリキュラム", "を提供しています。従って、このカリキュラムに従って学習すれば、多少異なっ", "たキーボードにもすぐに適用できます。", "このカリキュラムは、Typingをワークステーションおよびパソコンで実行するこ", "とを考慮して、標準的な日本語、英語キーボードのキー配列で無理なく練習でき", "ることを確認し、また、多少の改良を加えています。", "", "もちろん、色々な記号の入力をタッチタイピングで行いたい人のために、記号の", "入力用のレッスンも用意しています。また、いわゆるテンキーによる数値入力の", "ために、テンキーのタッチタイピングのコースも用意してあります。", "さらに、かな入力の練習がしたい人は、かな入力コースも選択できます。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、国産パソコンのキーボード設定で動作しています。", "", "このキーボードでは、「カナ」キーを押すことによって半角カタカナが入力でき", "るはずです。主に国産パソコンの MS-DOSで Typistを使う場合にこの設定で使用", "します（かな入力の練習をしない場合は日本語106キーボードの設定でも、特に", "問題ありません）。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード", "        -ke     101キーボード", "        -kk     国産パソコンのキーボード", "", "例えば、106キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -kj", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        日本語入力について", "", "Typistに現在用意されているカリキュラムは海外で開発されたものですので、ほ", "とんどのレッスンは英語がベースとなっています。", "", "しかし、タイピングで最も重要な指の位置や指の動かし方は、英語でも日本語で", "も変わりません。Typistで練習したあと、指の動きに注意してタイプするように", "心がければ、日本語の入力もタッチタイピングで行えるようになります。", "特に、ローマ字入力方式で入力している人の場合には、その効果はすぐに現れる", "でしょう。", "", "Typistは、かな入力方式の練習用のレッスンを提供しています。かな入力をマス", "ターしようとしている人は、このレッスンで指づかいの基本を習得することがで", "きるでしょう。"]
}
, {kind:"T", lines:["                        どのコースを選択すべきか", "", "Typingにはさまざまな練習用のコースが用意されています。どれを選択して練習", "したらよいのか、戸惑ってしまうかもしれませんね。", "", "        標準コース  (t1 - t16)          スピードアップ  (s1 - s4)", "        標準ドリル  (u1 - u13)          速習コース      (q1 - q5)", "        集中ドリル  (v1 - v20)          上達コース      (r1 - r14)", "        実戦ドリル  (m1 - m11)          数字入力コース  (n1 - n3)", "        かな入力コース (k1 - k16)       かな実践コース  (j1 - j7)", "", "普通は「標準コース」(Tコース)を選択すれば十分です。", "副教材として「標準ドリル」(Uコース)や、「集中ドリル」(Vコース)をするのも", "良いでしょう。これらが終わったら、「スピードアップ」や「実戦ドリル」に挑", "戦すれば、さらに腕を磨くことができるでしょう。", "簡単にタッチタイピングの概要を身につけたい人は「速習コース」を選択するこ", "ともできますが、時間にゆとりがあるなら「標準」を勧めます。", "また、かな入力の練習用には「かな入力コース」、かな入力による文章の練習用", "に「かな実践コース」が設けられています。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "練習の方法は、レッスンの中でも説明されています。ここでは概略だけを説明し", "ておきましょう。", "", "レッスンでは、画面の中ほどにテキストを１行〜数行表示し、画面の上の方に指", "示を表示します。", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "行末まで打ち終えたら、改行(Return)キーを打ちます。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。"]
}
, {kind:"I", lines:["実際にやってみましょう。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"D", lines:["ffff"]
}
, {kind:"T", lines:["                        スピード練習", "", "練習の方法には、もうひとつ、スピード練習と呼んでいるものがあります。", "前の練習では、表示されたテキストの下の行にタイプして行きましたが、この方", "法では、表示されたテキストの上にタイプして行きます。", "", "タイプ間違いをした時には、音で知らせ、誤った部分を強調表示します。Delete", "キーを使うこともできますが、できれば使わないでどんどん打ち続けて下さい。", "", "この練習では、どのくらい早く正確に入力できたか、を自己採点します。タイプ", "し終わったら、画面の下に毎分に入力できる単語数(語/分:WPM)という形で入力", "スピードが計算されます。また、誤りの数も数えて、総数を表示します。"]
}
, {kind:"I", lines:["実際にやってみましょう。Jは右人差し指、空白は右親指で打ちます。"]
}
, {kind:"P", lines:["fff jjj fjfj"]
}
, {kind:"T", lines:["                        かな入力", "", "Typistでは FEP（フロントエンド・プロセッサ）を利用せずに、かな入力の練習", "ができます。かな入力コースでは、FEPを起動せず、指定されたキーをそのまま", "タイプして下さい。画面にはひらがなが表示されます。", "", "国産パソコンのキーボードの設定になっている場合は「カナ」キーを押してから", "練習を開始します。", ""]
}
, {kind:"I", lines:["実際にやってみましょう。「は」は Fのキー、「ま」は Jのキーです。"]
}
, {kind:"K", lines:["ははは  ままま"]
}
, {kind:"T", lines:["                        練習履歴データ", "", "ひとつのレッスンを終了すると、その情報はファイルの上に記憶されます。", "UNIXの場合は ~/.typistrc というファイルに、MS-DOSでは $HOME/typist.dat", "というファイルに、どのコースはどのレッスンまで終わったかという情報が記録", "されます。", "ただし、環境変数 TYPDATA にファイルのパスが設定されていれば、そのファイル", "が履歴ファイルとなります。MS-DOSの場合、環境変数 HOME も TYPDATA も設定さ", "れていなければファイルは作成されません。", "", "このファイルに書かれた情報は次回に練習を開始する時にメニューといっしょに", "表示されますので、次のレッスンから練習を開始できます。"]
}
, {kind:"T", lines:["                        練習中の特殊なキー操作", "", "練習の画面が表示されている時、以下のキーで特別な動作が可能です。", "", "        Control-F       その画面の練習をせずに次の画面に移ります。", "", "        Control-L       その時に選択しているレッスンを中止して、", "                        コース選択の画面に戻ります。", "", "        Control-C       Typist を終わりにします。", "", "ただし、あるレッスンの中で Control-F を使うと、そのレッスンは真面目に練習", "して終了したものとは見なされませんので注意して下さい。", "逆に、この機能はレッスンの内容をざっと見るのに便利です。"]
}
, {kind:"T", lines:["                        タイプ後の特殊なキー操作", "", "画面の一番下に「次に進むには何かキーを押して下さい...」と表示されている時", "には、次のキーは特殊な機能キーとして働きます。", "", "        Backspaceキー   あるいは", "        Control-H       その画面の練習内容をもう一度繰り返します。", "                        （練習の後にだけ有効）", "", "        Control-G       間違えた時のクリック音（ビープ音）を出す／出さない", "                        の切り替えを行います。", "", "        ?               簡単なヘルプを表示します。", "", "打ち間違いの有無に関わらず、ある画面の表示内容を何回も繰り返して練習したい", "場合には、Backspaceキーで繰り返し練習が可能です。", "通常は１回しか練習できないスピード練習にも、何度も挑戦できます。"]
}
, {kind:"T", lines:["                        コマンドライン", "", "  Typistを起動する時、コマンドラインにオプションを指定できます。", "", "一般形:  typist [オプション] [lesson]", "", "オプション:", "        -k?     ? でキーボードのタイプを指定します。", "                j: 106キー,  e: 101キー,  k: 国産パソコン", "        -L???   ??? で示されるディレクトリのレッスンデータを使います。", "        -q      間違えた時にクリック音（ビープ音）を出さないようにします。", "        -V      現在のバージョン情報を表示します。", "", "Lesson:", "        練習したいレッスンを直接指定します。例えば", "                typist t5", "        とすると、レッスン t5 をすぐに始められます。"]
}
, {kind:"T", lines:["", "", "  Typist は DECUSのテープのBASIC版を元に、D. Jason Penney氏によって作成さ", "れ、配布されました。この日本語版の元となったものは、uxc.cso.uiuc.edu で配", "布されていた 1991年11月の版です。", "", "  プログラムの日本語への対応、および機能の拡張は荻原によって行われました。", "  レッスン用データの日本語化および内容の誤りの訂正、一部変更はすべて荻原の", "責任において行われております。", "", "  このプログラムとレッスン用データは自由に再配布可能ですが、有償での販売等", "はお断りします。", "", "    1997-05-20    神戸大学大学院 自然科学研究科 荻原剛志", "                  ogihara@seg.kobe-u.ac.jp"]
}
]
, keytype:"k", num:"1"}
, {course:"?", data:[{kind:"T", lines:["                        Typistへようこそ.", "", "Typist は、キーボードのタッチタイピング（ブラインドタッチ）を学習するた", "めのソフトウェアです。タッチタイピングの基本から少しずつ練習を積み重ね、", "やがてタイピングのエキスパートになるまでのカリキュラムが用意されています。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "ただし、タイプする時にキーの上の指を見ることは避けましょう。これは大変悪", "い習慣で、なかなか上達できません。このプログラムでは、誤ったキーインは画", "面上でそれとわかるように表示します。", "", "あなたがこれまで、目で見てキーを押すという方法でタイプしていたのなら、見", "ないで打つのはちょっと苦労かもしれません。でも、タッチタイピングがこれま", "での方法より遅いとしても、練習をあきらめないで下さい。一度この方法を身に", "つけてしまえば、遥かに速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        対象とするキーボード", "", "これまでにワープロやタイプライタ、パソコンなどを扱ったことのある人なら、", "キーボードと言っても文字の配列の仕方にさまざまなものがあることをご存じで", "しょう。", "", "Typistは、標準のアルファベット入力の上達にもっとも力を注いだカリキュラム", "を提供しています。従って、このカリキュラムに従って学習すれば、多少異なっ", "たキーボードにもすぐに適用できます。", "このカリキュラムは、Typingをワークステーションおよびパソコンで実行するこ", "とを考慮して、標準的な日本語、英語キーボードのキー配列で無理なく練習でき", "ることを確認し、また、多少の改良を加えています。", "", "もちろん、色々な記号の入力をタッチタイピングで行いたい人のために、記号の", "入力用のレッスンも用意しています。また、いわゆるテンキーによる数値入力の", "ために、テンキーのタッチタイピングのコースも用意してあります。", "さらに、かな入力の練習がしたい人は、かな入力コースも選択できます。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、106キーボードの設定で動作しています。", "", "このキーボードでは、改行キーの近くに '[' と ']' が縦に並んで配置され、数", "字の '2' とシフトキーで '\"' が入力できるはずです。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード", "        -ke     101キーボード", "        -kk     国産パソコンのキーボード", "", "例えば、101キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -ke", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        日本語入力について", "", "Typistに現在用意されているカリキュラムは海外で開発されたものですので、ほ", "とんどのレッスンは英語がベースとなっています。", "", "しかし、タイピングで最も重要な指の位置や指の動かし方は、英語でも日本語で", "も変わりません。Typistで練習したあと、指の動きに注意してタイプするように", "心がければ、日本語の入力もタッチタイピングで行えるようになります。", "特に、ローマ字入力方式で入力している人の場合には、その効果はすぐに現れる", "でしょう。", "", "Typistは、かな入力方式の練習用のレッスンを提供しています。かな入力をマス", "ターしようとしている人は、このレッスンで指づかいの基本を習得することがで", "きるでしょう。"]
}
, {kind:"T", lines:["                        どのコースを選択すべきか", "", "Typingにはさまざまな練習用のコースが用意されています。どれを選択して練習", "したらよいのか、戸惑ってしまうかもしれませんね。", "", "        標準コース  (t1 - t16)          スピードアップ  (s1 - s4)", "        標準ドリル  (u1 - u13)          速習コース      (q1 - q5)", "        集中ドリル  (v1 - v20)          上達コース      (r1 - r14)", "        実戦ドリル  (m1 - m11)          数字入力コース  (n1 - n3)", "        かな入力コース (k1 - k16)       かな実践コース  (j1 - j7)", "", "普通は「標準コース」(Tコース)を選択すれば十分です。", "副教材として「標準ドリル」(Uコース)や、「集中ドリル」(Vコース)をするのも", "良いでしょう。これらが終わったら、「スピードアップ」や「実戦ドリル」に挑", "戦すれば、さらに腕を磨くことができるでしょう。", "簡単にタッチタイピングの概要を身につけたい人は「速習コース」を選択するこ", "ともできますが、時間にゆとりがあるなら「標準」を勧めます。", "また、かな入力の練習用には「かな入力コース」、かな入力による文章の練習用", "に「かな実践コース」が設けられています。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "練習の方法は、レッスンの中でも説明されています。ここでは概略だけを説明し", "ておきましょう。", "", "レッスンでは、画面の中ほどにテキストを１行〜数行表示し、画面の上の方に指", "示を表示します。", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "行末まで打ち終えたら、改行(Return)キーを打ちます。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。"]
}
, {kind:"I", lines:["実際にやってみましょう。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"D", lines:["ffff"]
}
, {kind:"T", lines:["                        スピード練習", "", "練習の方法には、もうひとつ、スピード練習と呼んでいるものがあります。", "前の練習では、表示されたテキストの下の行にタイプして行きましたが、この方", "法では、表示されたテキストの上にタイプして行きます。", "", "タイプ間違いをした時には、音で知らせ、誤った部分を強調表示します。Delete", "キーを使うこともできますが、できれば使わないでどんどん打ち続けて下さい。", "", "この練習では、どのくらい早く正確に入力できたか、を自己採点します。タイプ", "し終わったら、画面の下に毎分に入力できる単語数(語/分:WPM)という形で入力", "スピードが計算されます。また、誤りの数も数えて、総数を表示します。"]
}
, {kind:"I", lines:["実際にやってみましょう。Jは右人差し指、空白は右親指で打ちます。"]
}
, {kind:"P", lines:["fff jjj fjfj"]
}
, {kind:"T", lines:["                        かな入力", "", "Typistでは FEP（フロントエンド・プロセッサ）を利用せずに、かな入力の練習", "ができます。かな入力コースでは、FEPを起動せず、指定されたキーをそのまま", "タイプして下さい。画面にはひらがなが表示されます。", ""]
}
, {kind:"I", lines:["実際にやってみましょう。「は」は Fのキー、「ま」は Jのキーです。"]
}
, {kind:"K", lines:["ははは  ままま"]
}
, {kind:"T", lines:["                        練習履歴データ", "", "ひとつのレッスンを終了すると、その情報はファイルの上に記憶されます。", "UNIXの場合は ~/.typistrc というファイルに、MS-DOSでは $HOME/typist.dat", "というファイルに、どのコースはどのレッスンまで終わったかという情報が記録", "されます。", "ただし、環境変数 TYPDATA にファイルのパスが設定されていれば、そのファイル", "が履歴ファイルとなります。MS-DOSの場合、環境変数 HOME も TYPDATA も設定さ", "れていなければファイルは作成されません。", "", "このファイルに書かれた情報は次回に練習を開始する時にメニューといっしょに", "表示されますので、次のレッスンから練習を開始できます。"]
}
, {kind:"T", lines:["                        練習中の特殊なキー操作", "", "練習の画面が表示されている時、以下のキーで特別な動作が可能です。", "", "        Control-F       その画面の練習をせずに次の画面に移ります。", "", "        Control-L       その時に選択しているレッスンを中止して、", "                        コース選択の画面に戻ります。", "", "        Control-C       Typist を終わりにします。", "", "ただし、あるレッスンの中で Control-F を使うと、そのレッスンは真面目に練習", "して終了したものとは見なされませんので注意して下さい。", "逆に、この機能はレッスンの内容をざっと見るのに便利です。"]
}
, {kind:"T", lines:["                        タイプ後の特殊なキー操作", "", "画面の一番下に「次に進むには何かキーを押して下さい...」と表示されている時", "には、次のキーは特殊な機能キーとして働きます。", "", "        Backspaceキー   あるいは", "        Control-H       その画面の練習内容をもう一度繰り返します。", "                        （練習の後にだけ有効）", "", "        Control-G       間違えた時のクリック音（ビープ音）を出す／出さない", "                        の切り替えを行います。", "", "        ?               簡単なヘルプを表示します。", "", "打ち間違いの有無に関わらず、ある画面の表示内容を何回も繰り返して練習したい", "場合には、Backspaceキーで繰り返し練習が可能です。", "通常は１回しか練習できないスピード練習にも、何度も挑戦できます。"]
}
, {kind:"T", lines:["                        コマンドライン", "", "  Typistを起動する時、コマンドラインにオプションを指定できます。", "", "一般形:  typist [オプション] [lesson]", "", "オプション:", "        -k?     ? でキーボードのタイプを指定します。", "                j: 106キー,  e: 101キー,  k: 国産パソコン", "        -L???   ??? で示されるディレクトリのレッスンデータを使います。", "        -q      間違えた時にクリック音（ビープ音）を出さないようにします。", "        -V      現在のバージョン情報を表示します。", "", "Lesson:", "        練習したいレッスンを直接指定します。例えば", "                typist t5", "        とすると、レッスン t5 をすぐに始められます。"]
}
, {kind:"T", lines:["", "", "  Typist は DECUSのテープのBASIC版を元に、D. Jason Penney氏によって作成さ", "れ、配布されました。この日本語版の元となったものは、uxc.cso.uiuc.edu で配", "布されていた 1991年11月の版です。", "", "  プログラムの日本語への対応、および機能の拡張は荻原によって行われました。", "  レッスン用データの日本語化および内容の誤りの訂正、一部変更はすべて荻原の", "責任において行われております。", "", "  このプログラムとレッスン用データは自由に再配布可能ですが、有償での販売等", "はお断りします。", "", "    1997-05-20    神戸大学大学院 自然科学研究科 荻原剛志", "                  ogihara@seg.kobe-u.ac.jp"]
}
]
, keytype:"j", num:"1"}
]
;
