if (!this["Typist_lesson_data"]) Typist_lesson_data = {};
Typist_lesson_data["j"] = [{course:"j", data:[{kind:"T", lines:["                            Lesson J6", "", "今回は連作です。"]
}
, {kind:"I", lines:["(1) 科学的な啓蒙とは？"]
}
, {kind:"q", lines:["人の  著作を、    非科学的、      迷信、    勘違い、      といった", "ひとのちょさくを、ひかか゛くてき、めいしん、かんちか゛い、といった", "調子で      こき下ろしたり、笑い物に    する人々が        いる。", "ちょうして゛こきおろしたり、わらいものにするひとひ゛とか゛いる。", "本当に    矛盾      だらけの  お粗末な  ものも多いが、    人と", "ほんとうにむし゛ゅんた゛らけのおそまつなものもおおいか゛、ひとと", "違う、    新しい    発想の    中からこそ、  真に  優れた    発見が", "ちか゛う、あたらしいはっそうのなかからこそ、しんにすく゛れたはっけんか゛", "生まれるので  はないだろうか。  奇異な意見に、  迷信とか、", "うまれるのて゛はないた゛ろうか。きいないけんに、めいしんとか、", "勘違いと      いったレッテルを貼って笑い物にし、    排除      するのは、", "かんちか゛いといったれってるをはってわらいものにし、はいし゛ょするのは、", "啓蒙に    名を借りた十字軍的              迷惑    行為  と言える。", "けいもうになをかりたし゛ゅうし゛く゛んてきめいわくこういといえる。"]
}
, {kind:"I", lines:["(2) 迷信のもうひとつの危険性"]
}
, {kind:"q", lines:["迷信と    言えば、  こんな逸話が    ある。", "めいしんといえは゛、こんないつわか゛ある。", "かのガリレオ・ガリレイが、      「潮の  満ち引きを月の  せいだと", "かのか゛りれお・か゛りれいか゛、「しおのみちひきをつきのせいた゛と", "考えるのは      迷信だ」、      と語って  いたというのである。", "かんか゛えるのはめいしんた゛」、とかたっていたというのて゛ある。", "迷信は、    それにとらわれる危険の  他に、  科学的      批判の", "めいしんは、それにとらわれるきけんのほかに、かか゛くてきひはんの", "対象を      曇らせてしまう  危険も  あるという良い例で    ある。", "たいしょうをくもらせてしまうきけんもあるというよいれいて゛ある。"]
}
, {kind:"I", lines:["(3) 迷信と科学"]
}
, {kind:"q", lines:["人の  意見を  迷信だと      切り捨てる態度も    正しくないが、", "ひとのいけんをめいしんた゛ときりすてるたいと゛もたた゛しくないか゛、", "無批判に  信じてしまう    態度は    さらに危険で    ある。", "むひはんにしんし゛てしまうたいと゛はさらにきけんて゛ある。", "空中に      浮揚できる    といった類の      事柄を      盲信した", "くうちゅうにふようて゛きるといったたく゛いのことか゛らをもうしんした", "某教団の            事件が、      そのことを如実に      教えている。", "ほ゛うきょうた゛んのし゛けんか゛、そのことをにょし゛つにおしえている。", "しかし、科学的な      判断を、      盲信と    切り捨ての中庸に", "しかし、かか゛くてきなはんた゛んを、もうしんときりすてのちゅうように", "置くということは、実は    結構    難しいことである。", "おくということは、し゛つはけっこうむつかしいことて゛ある。"]
}
]
, keytype:"ejk", num:"6"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J3", "", "星占いについてタイプしてみましょうか。", ""]
}
, {kind:"I", lines:["(1) 太陽と星"]
}
, {kind:"q", lines:["占星術は          古代    バビロニア    あたりで  生まれたものと", "せんせいし゛ゅつはこた゛いは゛ひ゛ろにああたりて゛うまれたものと", "考えられています。      太陽と    天空の    星たちは、  地球の", "かんか゛えられています。たいようとてんくうのほしたちは、ちきゅうの", "自転に    合わせて、一日に    約  一回転します。      しかし、", "し゛てんにあわせて、いちにちにやくいっかいてんします。しかし、", "地球は    太陽の    回りを  公転して    いますから、季節の  移り", "ちきゅうはたいようのまわりをこうてんしていますから、きせつのうつり", "変わりとともに、太陽は    星々の      間を      移動して    行く", "かわりとともに、たいようはほしほ゛しのあいた゛をいと゛うしていく", "ように見えます。この、太陽が      空を  移動する    通り道の", "ようにみえます。この、たいようか゛そらをいと゛うするとおりみちの", "ことを、「黄道」      といいます。", "ことを、「こうと゛う」といいます。"]
}
, {kind:"I", lines:["(2) 黄道と星座"]
}
, {kind:"q", lines:["占星術で            注意しなければ      ならないのは、星座の", "せんせいし゛ゅつて゛ちゅういしなけれは゛ならないのは、せいさ゛の", "考え方        です。  占星術では、            春分の日の", "かんか゛えかたて゛す。せんせいし゛ゅつて゛は、しゅんふ゛んのひの", "太陽の    いちを起点として、  黄道を      十二等分し、", "たいようのいちをきてんとして、こうと゛うをし゛ゅうにとうふ゛んし、", "これに名前を  付けました。これが  「サイン」、いわゆる星座と", "これになまえをつけました。これか゛「さいん」、いわゆるせいさ゛と", "呼ばれる  ものです。  つまり、占星術の          サインは、", "よは゛れるものて゛す。つまり、せんせいし゛ゅつのさいんは、", "夜空の    星座の    位置から来たものでは  ないのです。", "よそ゛らのせいさ゛のいちからきたものて゛はないのて゛す。"]
}
, {kind:"I", lines:["(3) １３星座？"]
}
, {kind:"q", lines:["以上の      説明から、    最近    出て  来た「十三        星座", "いし゛ょうのせつめいから、さいきんて゛てきた「し゛ゅうさんせいさ゛", "占い」    というのは、かなり怪しい  説  ということになります。", "うらない」というのは、かなりあやしいせつということになります。", "恒星の    位置は、確かに  長い    年月の      うちには移動    します", "こうせいのいちは、たしかになか゛いねんけ゛つのうちにはいと゛うします", "が、  千年    くらいの間に      黄道に      新しい    星座が", "か゛、せんねんくらいのあいた゛にこうと゛うにあたらしいせいさ゛か゛", "割込む  ような大きな  変化は  起きません。もちろん、占星術", "わりこむようなおおきなへんかはおきません。もちろん、せんせいし゛ゅつ", "自体を    非科学的な      ものと見るのであれば、    星座の", "し゛たいをひかか゛くてきなものとみるのて゛あれは゛、せいさ゛の", "数    など、  そもそも問題      にはならないのでしょう  けれどね。", "かす゛なと゛、そもそももんた゛いにはならないのて゛しょうけれと゛ね。"]
}
]
, keytype:"e", num:"3"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J3", "", "星占いについてタイプしてみましょうか。", "", "国産パソコンを使っている人は、「カナ」キーを押した状態にして下さい。", ""]
}
, {kind:"I", lines:["(1) 太陽と星"]
}
, {kind:"q", lines:["占星術は          古代    バビロニア    あたりで  生まれたものと", "せんせいし゛ゅつはこた゛いは゛ひ゛ろにああたりて゛うまれたものと", "考えられています。      太陽と    天空の    星たちは、  地球の", "かんか゛えられています。たいようとてんくうのほしたちは、ちきゅうの", "自転に    合わせて、一日に    約  一回転します。      しかし、", "し゛てんにあわせて、いちにちにやくいっかいてんします。しかし、", "地球は    太陽の    回りを  公転して    いますから、季節の  移り", "ちきゅうはたいようのまわりをこうてんしていますから、きせつのうつり", "変わりとともに、太陽は    星々の      間を      移動して    行く", "かわりとともに、たいようはほしほ゛しのあいた゛をいと゛うしていく", "ように見えます。この、太陽が      空を  移動する    通り道の", "ようにみえます。この、たいようか゛そらをいと゛うするとおりみちの", "ことを、「黄道」      といいます。", "ことを、「こうと゛う」といいます。"]
}
, {kind:"I", lines:["(2) 黄道と星座"]
}
, {kind:"q", lines:["占星術で            注意しなければ      ならないのは、星座の", "せんせいし゛ゅつて゛ちゅういしなけれは゛ならないのは、せいさ゛の", "考え方        です。  占星術では、            春分の日の", "かんか゛えかたて゛す。せんせいし゛ゅつて゛は、しゅんふ゛んのひの", "太陽の    いちを起点として、  黄道を      十二等分し、", "たいようのいちをきてんとして、こうと゛うをし゛ゅうにとうふ゛んし、", "これに名前を  付けました。これが  「サイン」、いわゆる星座と", "これになまえをつけました。これか゛「さいん」、いわゆるせいさ゛と", "呼ばれる  ものです。  つまり、占星術の          サインは、", "よは゛れるものて゛す。つまり、せんせいし゛ゅつのさいんは、", "夜空の    星座の    位置から来たものでは  ないのです。", "よそ゛らのせいさ゛のいちからきたものて゛はないのて゛す。"]
}
, {kind:"I", lines:["(3) １３星座？"]
}
, {kind:"q", lines:["以上の      説明から、    最近    出て  来た「十三        星座", "いし゛ょうのせつめいから、さいきんて゛てきた「し゛ゅうさんせいさ゛", "占い」    というのは、かなり怪しい  説  ということになります。", "うらない」というのは、かなりあやしいせつということになります。", "恒星の    位置は、確かに  長い    年月の      うちには移動    します", "こうせいのいちは、たしかになか゛いねんけ゛つのうちにはいと゛うします", "が、  千年    くらいの間に      黄道に      新しい    星座が", "か゛、せんねんくらいのあいた゛にこうと゛うにあたらしいせいさ゛か゛", "割込む  ような大きな  変化は  起きません。もちろん、占星術", "わりこむようなおおきなへんかはおきません。もちろん、せんせいし゛ゅつ", "自体を    非科学的な      ものと見るのであれば、    星座の", "し゛たいをひかか゛くてきなものとみるのて゛あれは゛、せいさ゛の", "数    など、  そもそも問題      にはならないのでしょう  けれどね。", "かす゛なと゛、そもそももんた゛いにはならないのて゛しょうけれと゛ね。"]
}
]
, keytype:"k", num:"3"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J3", "", "星占いについてタイプしてみましょうか。", ""]
}
, {kind:"I", lines:["(1) 太陽と星"]
}
, {kind:"q", lines:["占星術は          古代    バビロニア    あたりで  生まれたものと", "せんせいし゛ゅつはこた゛いは゛ひ゛ろにああたりて゛うまれたものと", "考えられています。      太陽と    天空の    星たちは、  地球の", "かんか゛えられています。たいようとてんくうのほしたちは、ちきゅうの", "自転に    合わせて、一日に    約  一回転します。      しかし、", "し゛てんにあわせて、いちにちにやくいっかいてんします。しかし、", "地球は    太陽の    回りを  公転して    いますから、季節の  移り", "ちきゅうはたいようのまわりをこうてんしていますから、きせつのうつり", "変わりとともに、太陽は    星々の      間を      移動して    行く", "かわりとともに、たいようはほしほ゛しのあいた゛をいと゛うしていく", "ように見えます。この、太陽が      空を  移動する    通り道の", "ようにみえます。この、たいようか゛そらをいと゛うするとおりみちの", "ことを、「黄道」      といいます。", "ことを、「こうと゛う」といいます。"]
}
, {kind:"I", lines:["(2) 黄道と星座"]
}
, {kind:"q", lines:["占星術で            注意しなければ      ならないのは、星座の", "せんせいし゛ゅつて゛ちゅういしなけれは゛ならないのは、せいさ゛の", "考え方        です。  占星術では、            春分の日の", "かんか゛えかたて゛す。せんせいし゛ゅつて゛は、しゅんふ゛んのひの", "太陽の    いちを起点として、  黄道を      十二等分し、", "たいようのいちをきてんとして、こうと゛うをし゛ゅうにとうふ゛んし、", "これに名前を  付けました。これが  「サイン」、いわゆる星座と", "これになまえをつけました。これか゛「さいん」、いわゆるせいさ゛と", "呼ばれる  ものです。  つまり、占星術の          サインは、", "よは゛れるものて゛す。つまり、せんせいし゛ゅつのさいんは、", "夜空の    星座の    位置から来たものでは  ないのです。", "よそ゛らのせいさ゛のいちからきたものて゛はないのて゛す。"]
}
, {kind:"I", lines:["(3) １３星座？"]
}
, {kind:"q", lines:["以上の      説明から、    最近    出て  来た「十三        星座", "いし゛ょうのせつめいから、さいきんて゛てきた「し゛ゅうさんせいさ゛", "占い」    というのは、かなり怪しい  説  ということになります。", "うらない」というのは、かなりあやしいせつということになります。", "恒星の    位置は、確かに  長い    年月の      うちには移動    します", "こうせいのいちは、たしかになか゛いねんけ゛つのうちにはいと゛うします", "が、  千年    くらいの間に      黄道に      新しい    星座が", "か゛、せんねんくらいのあいた゛にこうと゛うにあたらしいせいさ゛か゛", "割込む  ような大きな  変化は  起きません。もちろん、占星術", "わりこむようなおおきなへんかはおきません。もちろん、せんせいし゛ゅつ", "自体を    非科学的な      ものと見るのであれば、    星座の", "し゛たいをひかか゛くてきなものとみるのて゛あれは゛、せいさ゛の", "数    など、  そもそも問題      にはならないのでしょう  けれどね。", "かす゛なと゛、そもそももんた゛いにはならないのて゛しょうけれと゛ね。"]
}
]
, keytype:"j", num:"3"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J4", "", "今回の話題はいろいろです。"]
}
, {kind:"I", lines:["(1) 携帯電話"]
}
, {kind:"q", lines:["携帯電話は        脳腫瘍に      なるぞ、  という噂は    以前から", "けいたいて゛んわはのうしゅようになるそ゛、といううわさはいせ゛んから", "ちらほら聞こえていたが、  本当の    ところ、どうなんだろう。", "ちらほらきこえていたか゛、ほんとうのところ、と゛うなんた゛ろう。", "携帯の    マイクロ波は電子    レンジの  ものと基本的に    同じ", "けいたいのまいくろははて゛んしれんし゛のものときほんてきにおなし゛", "だけれど、    周波数が        違うので、      危険は  ないんだ  そうだ。", "た゛けれと゛、しゅうはすうか゛ちか゛うのて゛、きけんはないんた゛そうた゛。", "でも、  何十年も          使い  続けても    大丈夫            なのかな。", "て゛も、なんし゛ゅうねんもつかいつつ゛けてもた゛いし゛ょうふ゛なのかな。", "将来、      携帯電話        利用者の    ガン  発生率が        明らかに", "しょうらい、けいたいて゛んわりようしゃのか゛んはっせいりつか゛あきらかに", "高いことが    わかったら、一体    どう  するんだ  ろうね。", "たかいことか゛わかったら、いったいと゛うするんた゛ろうね。"]
}
, {kind:"I", lines:["(2) 詐欺の手口"]
}
, {kind:"q", lines:["老人を      相手に、  株    取り引きの詐欺を  していたグループの", "ろうし゛んをあいてに、かふ゛とりひきのさき゛をしていたく゛るーふ゜の", "手口を    紹介      しよう。彼らは  多数の  老人に      電話を    かけ、", "てく゛ちをしょうかいしよう。かれらはたすうのろうし゛んにて゛んわをかけ、", "その半数に、    ある銘柄が        値上がり  すると言い、残りの  半数", "そのはんすうに、あるめいか゛らか゛ねあか゛りするといい、のこりのはんすう", "には、値下がり  すると言う。実際に      値上がり  したら、値上がり  する", "には、ねさか゛りするという。し゛っさいにねあか゛りしたら、ねあか゛りする", "と言っておいた半数の    老人に      だけ、  再度    電話を    する。", "といっておいたはんすうのろうし゛んにた゛け、さいと゛て゛んわをする。", "そしてまた半数に    分けて、同じ    ことを繰り返す。  すると、たまたま", "そしてまたはんすうにわけて、おなし゛ことをくりかえす。すると、たまたま", "残った  老人には、      予想が    すべて  的中      したように見える。", "のこったろうし゛んには、よそうか゛すへ゛ててきちゅうしたようにみえる。"]
}
, {kind:"I", lines:["(3) 奇跡のペンダント"]
}
, {kind:"q", lines:["このペンダントには、    古代より    不思議な  力が      宿ると", "このへ゜んた゛んとには、こた゛いよりふしき゛なちからか゛やと゛ると", "言い伝え  られてきた、ラピス・ラズリが      はめ込まれ、さらに異性を", "いいつたえられてきた、らひ゜す・らす゛りか゛はめこまれ、さらにいせいを", "引き寄せるピューマが    彫刻      されています。このペンダントを", "ひきよせるひ゜ゅーまか゛ちょうこくされています。このへ゜んた゛んとを", "身につけたとたん、思いも  かけない幸運が      舞い込んで  来たという", "みにつけたとたん、おもいもかけないこううんか゛まいこんて゛きたという", "喜びの      お便りが    沢山    寄せられています。あなたも是非、", "よろこひ゛のおたよりか゛たくさんよせられています。あなたもせ゛ひ、", "この機会に。  ペアで    お求めになると、  効果も  倍増        します。", "このきかいに。へ゜あて゛おもとめになると、こうかもは゛いそ゛うします。"]
}
]
, keytype:"ejk", num:"4"}
, {course:"j", data:[{kind:"T", lines:["                        かな実践コースへようこそ", "", "Jコースのレッスンは、かな入力方式のタッチタイピングの練習です。", "このコースは、Kコースの練習をすでに終えていることを前提としています。", "", "このコースでは、いろいろなタイプの文章を入力してみます。文章はどれも短い", "ものですが、その内容はさまざまです。", "", "練習はスピード練習の形式ですが、練習の最後の「何かキーを押して下さい...」", "の所で Backspace、あるいは Deleteキーを入力すれば、そのレッスンの内容を", "何回も練習できます。", ""]
}
, {kind:"I", lines:["(1) 無灯火の自転車"]
}
, {kind:"q", lines:["暗い  夜道で、    無灯火の  自転車に      不意にでくわして  驚いた", "くらいよみちて゛、むとうかのし゛てんしゃにふいにて゛くわしておと゛ろいた", "経験は    ないだろうか。  自転車は、      夜道では    必ず      明かりを", "けいけんはないた゛ろうか。し゛てんしゃは、よみちて゛はかならす゛あかりを", "点灯    しなければならない。  点灯せずに      走っていて、  万一    ", "てんとうしなけれは゛ならない。てんとうせす゛にはしっていて、まんいち", "事故を  起こした場合、    責任を    負わねば  ならないのはもちろん、", "し゛こをおこしたは゛あい、せきにんをおわねは゛ならないのはもちろん、", "保険も  適用    されず、  刑法上の          罪に  問われることさえある。", "ほけんもてきようされす゛、けいほうし゛ょうのつみにとわれることさえある。"]
}
, {kind:"I", lines:["(2) ストーキング"]
}
, {kind:"q", lines:["日本には、  「ストーキング」を  取り締まれる法律は    今の  ところ", "にほんには、「すとーきんく゛」をとりしまれるほうりつはいまのところ", "ないんです。  ですから、  民事上で            慰謝料を", "ないんて゛す。て゛すから、みんし゛し゛ょうて゛いしゃりょうを", "請求する      ことすらできない  状況          なんです。  相手が", "せいきゅうすることすらて゛きないし゛ょうきょうなんて゛す。あいてか゛", "わかったとしても、違法行為を    実証する        のは難しい    ですね。", "わかったとしても、いほうこういをし゛っしょうするのはむつかしいて゛すね。", "警察は    ほとんど  助けに  ならないと思って  いいでしょう。", "けいさつはほとんと゛たすけにならないとおもっていいて゛しょう。"]
}
, {kind:"I", lines:["(3) 週刊誌調"]
}
, {kind:"q", lines:["千葉  パイレーツに  頼もしい  パワフルな  助っ人が    登場した。", "ちは゛は゜いれーつにたのもしいは゜わふるなすけっとか゛とうし゛ょうした。", "現役      バリバリ    大リーガーの      ホプキンスだ。", "け゛んえきは゛りは゛りた゛いりーか゛ーのほふ゜きんすた゛。", "彼は  日本で    助っ人として  活躍した    プレーヤーが    メジャーに", "かれはにほんて゛すけっととしてかつやくしたふ゜れーやーか゛めし゛ゃーに", "戻って    大活躍        している例を  見て、大いに  触発      される", "もと゛ってた゛いかつやくしているれいをみて、おおいにしょくはつされる", "ものが  あったと語っている。  昨年、    ホームランを量産した", "ものか゛あったとかたっている。さくねん、ほーむらんをりょうさんした", "本場の    パワーに、  ファンならず  とも大注目だ。", "ほんは゛のは゜わーに、ふぁんならす゛ともた゛いちゅうもくた゛。"]
}
]
, keytype:"e", num:"1"}
, {course:"j", data:[{kind:"T", lines:["                        かな実践コースへようこそ", "", "Jコースのレッスンは、かな入力方式のタッチタイピングの練習です。", "このコースは、Kコースの練習をすでに終えていることを前提としています。", "", "このコースでは、いろいろなタイプの文章を入力してみます。文章はどれも短い", "ものですが、その内容はさまざまです。", "", "練習はスピード練習の形式ですが、練習の最後の「何かキーを押して下さい...」", "の所で Backspace、あるいは Deleteキーを入力すれば、そのレッスンの内容を", "何回も練習できます。", "", "国産パソコンを使っている人は、必ず「カナ」キーを押した状態にして練習して", "下さい。", ""]
}
, {kind:"I", lines:["(1) 無灯火の自転車"]
}
, {kind:"q", lines:["暗い  夜道で、    無灯火の  自転車に      不意にでくわして  驚いた", "くらいよみちて゛、むとうかのし゛てんしゃにふいにて゛くわしておと゛ろいた", "経験は    ないだろうか。  自転車は、      夜道では    必ず      明かりを", "けいけんはないた゛ろうか。し゛てんしゃは、よみちて゛はかならす゛あかりを", "点灯    しなければならない。  点灯せずに      走っていて、  万一    ", "てんとうしなけれは゛ならない。てんとうせす゛にはしっていて、まんいち", "事故を  起こした場合、    責任を    負わねば  ならないのはもちろん、", "し゛こをおこしたは゛あい、せきにんをおわねは゛ならないのはもちろん、", "保険も  適用    されず、  刑法上の          罪に  問われることさえある。", "ほけんもてきようされす゛、けいほうし゛ょうのつみにとわれることさえある。"]
}
, {kind:"I", lines:["(2) ストーキング"]
}
, {kind:"q", lines:["日本には、  「ストーキング」を  取り締まれる法律は    今の  ところ", "にほんには、「すとーきんく゛」をとりしまれるほうりつはいまのところ", "ないんです。  ですから、  民事上で            慰謝料を", "ないんて゛す。て゛すから、みんし゛し゛ょうて゛いしゃりょうを", "請求する      ことすらできない  状況          なんです。  相手が", "せいきゅうすることすらて゛きないし゛ょうきょうなんて゛す。あいてか゛", "わかったとしても、違法行為を    実証する        のは難しい    ですね。", "わかったとしても、いほうこういをし゛っしょうするのはむつかしいて゛すね。", "警察は    ほとんど  助けに  ならないと思って  いいでしょう。", "けいさつはほとんと゛たすけにならないとおもっていいて゛しょう。"]
}
, {kind:"I", lines:["(3) 週刊誌調"]
}
, {kind:"q", lines:["千葉  パイレーツに  頼もしい  パワフルな  助っ人が    登場した。", "ちは゛は゜いれーつにたのもしいは゜わふるなすけっとか゛とうし゛ょうした。", "現役      バリバリ    大リーガーの      ホプキンスだ。", "け゛んえきは゛りは゛りた゛いりーか゛ーのほふ゜きんすた゛。", "彼は  日本で    助っ人として  活躍した    プレーヤーが    メジャーに", "かれはにほんて゛すけっととしてかつやくしたふ゜れーやーか゛めし゛ゃーに", "戻って    大活躍        している例を  見て、大いに  触発      される", "もと゛ってた゛いかつやくしているれいをみて、おおいにしょくはつされる", "ものが  あったと語っている。  昨年、    ホームランを量産した", "ものか゛あったとかたっている。さくねん、ほーむらんをりょうさんした", "本場の    パワーに、  ファンならず  とも大注目だ。", "ほんは゛のは゜わーに、ふぁんならす゛ともた゛いちゅうもくた゛。"]
}
]
, keytype:"k", num:"1"}
, {course:"j", data:[{kind:"T", lines:["                        かな実践コースへようこそ", "", "Jコースのレッスンは、かな入力方式のタッチタイピングの練習です。", "このコースは、Kコースの練習をすでに終えていることを前提としています。", "", "このコースでは、いろいろなタイプの文章を入力してみます。文章はどれも短い", "ものですが、その内容はさまざまです。", "", "練習はスピード練習の形式ですが、練習の最後の「何かキーを押して下さい...」", "の所で Backspace、あるいは Deleteキーを入力すれば、そのレッスンの内容を", "何回も練習できます。", ""]
}
, {kind:"I", lines:["(1) 無灯火の自転車"]
}
, {kind:"q", lines:["暗い  夜道で、    無灯火の  自転車に      不意にでくわして  驚いた", "くらいよみちて゛、むとうかのし゛てんしゃにふいにて゛くわしておと゛ろいた", "経験は    ないだろうか。  自転車は、      夜道では    必ず      明かりを", "けいけんはないた゛ろうか。し゛てんしゃは、よみちて゛はかならす゛あかりを", "点灯    しなければならない。  点灯せずに      走っていて、  万一    ", "てんとうしなけれは゛ならない。てんとうせす゛にはしっていて、まんいち", "事故を  起こした場合、    責任を    負わねば  ならないのはもちろん、", "し゛こをおこしたは゛あい、せきにんをおわねは゛ならないのはもちろん、", "保険も  適用    されず、  刑法上の          罪に  問われることさえある。", "ほけんもてきようされす゛、けいほうし゛ょうのつみにとわれることさえある。"]
}
, {kind:"I", lines:["(2) ストーキング"]
}
, {kind:"q", lines:["日本には、  「ストーキング」を  取り締まれる法律は    今の  ところ", "にほんには、「すとーきんく゛」をとりしまれるほうりつはいまのところ", "ないんです。  ですから、  民事上で            慰謝料を", "ないんて゛す。て゛すから、みんし゛し゛ょうて゛いしゃりょうを", "請求する      ことすらできない  状況          なんです。  相手が", "せいきゅうすることすらて゛きないし゛ょうきょうなんて゛す。あいてか゛", "わかったとしても、違法行為を    実証する        のは難しい    ですね。", "わかったとしても、いほうこういをし゛っしょうするのはむつかしいて゛すね。", "警察は    ほとんど  助けに  ならないと思って  いいでしょう。", "けいさつはほとんと゛たすけにならないとおもっていいて゛しょう。"]
}
, {kind:"I", lines:["(3) 週刊誌調"]
}
, {kind:"q", lines:["千葉  パイレーツに  頼もしい  パワフルな  助っ人が    登場した。", "ちは゛は゜いれーつにたのもしいは゜わふるなすけっとか゛とうし゛ょうした。", "現役      バリバリ    大リーガーの      ホプキンスだ。", "け゛んえきは゛りは゛りた゛いりーか゛ーのほふ゜きんすた゛。", "彼は  日本で    助っ人として  活躍した    プレーヤーが    メジャーに", "かれはにほんて゛すけっととしてかつやくしたふ゜れーやーか゛めし゛ゃーに", "戻って    大活躍        している例を  見て、大いに  触発      される", "もと゛ってた゛いかつやくしているれいをみて、おおいにしょくはつされる", "ものが  あったと語っている。  昨年、    ホームランを量産した", "ものか゛あったとかたっている。さくねん、ほーむらんをりょうさんした", "本場の    パワーに、  ファンならず  とも大注目だ。", "ほんは゛のは゜わーに、ふぁんならす゛ともた゛いちゅうもくた゛。"]
}
]
, keytype:"j", num:"1"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J7", "", "今回はちょっと難しいかも。"]
}
, {kind:"I", lines:["(1) 十種の神宝"]
}
, {kind:"q", lines:["大和の  国、  石上      神宮に        伝えられて  いるという", "やまとのくに、いそのかみし゛んく゛うにつたえられているという", "「十種の  神宝」は、        神道の    中  でも  特に  謎と    されて", "「とくさのかんた゛から」は、しんとうのなかて゛もとくになそ゛とされて", "いる。これは十種の        剣、  玉、  比礼からなる。「比礼」とは、", "いる。これはし゛ゅっしゅのけん、たま、ひれからなる。「ひれ」とは、", "古代の    女性が        はおった薄い  布で、    災いを      祓う", "こた゛いのし゛ょせいか゛はおったうすいぬのて゛、わさ゛わいをはらう", "力が      あるとされたらしい。「三種の    神器」      と異なり、", "ちからか゛あるとされたらしい。「さんしゅのし゛んき゛」とことなり、", "この神宝は、      実体は      もちろん、容器  すら見た人は  ないと言う。", "このしんほ゜うは、し゛ったいはもちろん、ようきすらみたひとはないという。"]
}
, {kind:"I", lines:["(2) 消された神々"]
}
, {kind:"q", lines:["大和朝廷は、        最初から    日本  全土を      支配して  いた", "やまとちょうていは、さいしょからにほんせ゛んと゛をしはいしていた", "わけで  はない。朝廷に      「討伐」      される以前の    地方には、", "わけて゛はない。ちょうていに「とうは゛つ」されるいせ゛んのちほうには、", "記紀神話とは  別の    神々が        支配する  国家が    あった。", "ききしんわとはへ゛つのかみか゛みか゛しはいするこっかか゛あった。", "有名な    土着神に        アラハバキが    いる。東      日本の", "ゆうめいなと゛ちゃくしんにあらはは゛きか゛いる。ひか゛しにほんの", "民は  この神の  もと、中世に      至る  まで、  朝廷と      熾烈な", "たみはこのかみのもと、ちゅうせいにいたるまて゛、ちょうていとしれつな", "戦いを    繰り返し  ていたのである。", "たたかいをくりかえしていたのて゛ある。"]
}
, {kind:"I", lines:["(3) 最古の土器文明"]
}
, {kind:"q", lines:["世界  最古の  土器  文明は      どこで    興ったの  だろうか。  世界", "せかいさいこのと゛きふ゛んめいはと゛こて゛おこったのた゛ろうか。せかい", "各地で    出土する      土器は、  年代      測定で      数千年前", "かくちて゛しゅつと゛すると゛きは、ねんた゛いそくていて゛すうせんねんまえ", "しか示さない  のに対し、  日本  各地  からは一万    数千年前", "しかしめさないのにたいし、にほんかくちからはいちまんすうせんねんまえ", "という土器が    多数  出土      している。このような客観的な", "というと゛きか゛たすうしゅつと゛している。このようなきゃっかんてきな", "事実が        あるにも関わらず、    土器  文化    は渡来  したものだと", "し゛し゛つか゛あるにもかかわらす゛、と゛きふ゛んかはとらいしたものた゛と", "主張      する日本人      学者は      多い。", "しゅちょうするにほんし゛んか゛くしゃはおおい。"]
}
]
, keytype:"ejk", num:"7"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J5", "", "いろいろな文書。"]
}
, {kind:"I", lines:["(1) お役所"]
}
, {kind:"q", lines:["昨今の    行財政            改革に    伴う    自己  啓発    活動の", "さっこんのき゛ょうさ゛いせいかいかくにともなうし゛こけいはつかつと゛うの", "一環として、    「さわやか行政        サービス」  運動を      推進", "いっかんとして、「さわやかき゛ょうせいさーひ゛す」うんと゛うをすいしん", "することとなった。本省      各部所に      対して、  諮問  委員会    等", "することとなった。ほんしょうかくふ゛しょにたいして、しもんいいんかいとう", "より業務      体制の    硬直化が        指摘  されている所    でも", "よりき゛ょうむたいせいのこうちょくかか゛してきされているところて゛も", "あり、窓口      業務の      ある部局      ・部所においては、", "あり、まと゛くちき゛ょうむのあるふ゛きょく・ふ゛しょにおいては、", "利用者の    便を    考慮した    より効率的な      対応に    努める", "りようしゃのへ゛んをこうりょしたよりこうりつてきなたいおうにつとめる", "よう、周知    徹底を    して頂きたい。", "よう、しゅうちてっていをしていたた゛きたい。"]
}
, {kind:"I", lines:["(2) カタログ"]
}
, {kind:"q", lines:["本製品は、      ワールド  ・ワイド  ・ウェブ  をはじめ、", "ほんせいひんは、わーると゛・わいと゛・うぇふ゛をはし゛め、", "グループウェア、    データベース、    電子メールなど、", "く゛るーふ゜うぇあ、て゛ーたへ゛ーす、て゛んしめーるなと゛、", "イントラネット構築に    とって重要な        サーバ  機能を", "いんとらねっとこうちくにとってし゛ゅうようなさーは゛きのうを", "集約した、      まさに情報の        一元      管理を  実現        する", "しゅうやくした、まさにし゛ょうほうのいちけ゛んかんりをし゛つけ゛んする", "アプリケーション  ・サーバ  ・パッケージ    です。", "あふ゜りけーしょん・さーは゛・は゜っけーし゛て゛す。", "従来の        ワープロ  文書      などの  データベース    化にも", "し゛ゅうらいのわーふ゜ろふ゛んしょなと゛のて゛ーたへ゛ーすかにも", "威力を    発揮し、  セキュリティ対策も    万全        です。", "いりょくをはっきし、せきゅりてぃたいさくもは゛んせ゛んて゛す。"]
}
, {kind:"I", lines:["(3) インタビュー"]
}
, {kind:"q", lines:["音楽が        人類      普遍の  言葉    だ  というテーゼ  というか、", "おんか゛くか゛し゛んるいふへんのことは゛た゛というてーせ゛というか、", "理想論が      ありますよね。逆に、      アフリカの奥地では", "りそうろんか゛ありますよね。き゛ゃくに、あふりかのおくちて゛は", "モーツァルトもモーツァルトとしては聞こえない、という痛烈な", "もーつぁるとももーつぁるととしてはきこえない、というつうれつな", "言葉も    ありますが、  現在、        世界を  覆って  いるのは、", "ことは゛もありますか゛、け゛んさ゛い、せかいをおおっているのは、", "西洋    音楽      というより、類型化    された商業          音楽", "せいようおんか゛くというより、るいけいかされたしょうき゛ょうおんか゛く", "だと  言ってもいいかもしれませんね。", "た゛といってもいいかもしれませんね。"]
}
]
, keytype:"ejk", num:"5"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J2", "", "電子メールとか、ウィルスとか。", ""]
}
, {kind:"I", lines:["(1) ウィルス"]
}
, {kind:"q", lines:["これこれというサブジェクトの    メールを読むとコンピュータ  ・ウィルスに", "これこれというさふ゛し゛ぇくとのめーるをよむとこんひ゜ゅーた・うぃるすに", "感染    する、といった噂を    耳にする  ことがある。  これはまったくの", "かんせんする、といったうわさをみみにすることか゛ある。これはまったくの", "デマ  で  ある。原理的に、      メールを読んだ  だけ  で  感染", "て゛まて゛ある。け゛んりてきに、めーるをよんた゛た゛けて゛かんせん", "するようなウィルスはあり得ない。友達      が  親切心      から", "するようなうぃるすはありえない。ともた゛ちか゛しんせつしんから", "わざわざ    メールで  教えて  くれることもあるが、  それは今度は", "わさ゛わさ゛めーるて゛おしえてくれることもあるか゛、それはこんと゛は", "チェーン・メールとなる。", "ちぇーん・めーるとなる。"]
}
, {kind:"I", lines:["(2) チェーン・メール"]
}
, {kind:"q", lines:["チェーン・メールとは、人から  人へと  連鎖的に    送られる  うちに、", "ちぇーん・めーるとは、ひとからひとへとれんさてきにおくられるうちに、", "メールの総数が      ふくれ上がる  ようなものを言う。つまり、不幸の", "めーるのそうすうか゛ふくれあか゛るようなものをいう。つまり、ふこうの", "手紙の    ようなもので  ある。これも最近は    手が  こんで  きて、", "てか゛みのようなものて゛ある。これもさいきんはてか゛こんて゛きて、", "上で    述べたような  ウィルス情報、        当たり屋の車の    ナンバー", "うえて゛のへ゛たようなうぃるすし゛ょうほう、あたりやのくるまのなんは゛ー", "一覧、    瓶の    フタを集めると  ボランティアの  資金に  なります、", "いちらん、ひ゛んのふたをあつめるとほ゛らんてぃあのしきんになります、", "といった、人の  善意に    つけこんで  広がる    ものも多い。", "といった、ひとのせ゛んいにつけこんて゛ひろか゛るものもおおい。"]
}
, {kind:"I", lines:["(3) ウィルスの補足"]
}
, {kind:"q", lines:["メールを読んだ  だけで    感染する    ウィルスはない、と書いたが、", "めーるをよんた゛た゛けて゛かんせんするうぃるすはない、とかいたか゛、", "これには例外が        ある。これはマクロ・ウィルスというもので、", "これにはれいか゛いか゛ある。これはまくろ・うぃるすというものて゛、", "表計算        などの  データの  マクロに潜んで    いる。感染した", "ひょうけいさんなと゛のて゛ーたのまくろにひそんて゛いる。かんせんした", "データを  メールに貼りつけて送ると、  読んだ  側で      自動的に", "て゛ーたをめーるにはりつけておくると、よんた゛か゛わて゛し゛と゛うてきに", "マクロが  動き    出し、  感染する    というものである。  米国", "まくろか゛うこ゛きた゛し、かんせんするというものて゛ある。へ゛いこく", "某社の      ワープロ、  表計算        ソフトを使っている  人は", "ほ゛うしゃのわーふ゜ろ、ひょうけいさんそふとをつかっているひとは", "注意した    方が    いいだろう。", "ちゅういしたほうか゛いいた゛ろう。"]
}
]
, keytype:"e", num:"2"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J2", "", "電子メールとか、ウィルスとか。", "", "国産パソコンを使っている人は、必ず「カナ」キーを押した状態にして練習して", "下さい。", ""]
}
, {kind:"I", lines:["(1) ウィルス"]
}
, {kind:"q", lines:["これこれというサブジェクトの    メールを読むとコンピュータ  ・ウィルスに", "これこれというさふ゛し゛ぇくとのめーるをよむとこんひ゜ゅーた・うぃるすに", "感染    する、といった噂を    耳にする  ことがある。  これはまったくの", "かんせんする、といったうわさをみみにすることか゛ある。これはまったくの", "デマ  で  ある。原理的に、      メールを読んだ  だけ  で  感染", "て゛まて゛ある。け゛んりてきに、めーるをよんた゛た゛けて゛かんせん", "するようなウィルスはあり得ない。友達      が  親切心      から", "するようなうぃるすはありえない。ともた゛ちか゛しんせつしんから", "わざわざ    メールで  教えて  くれることもあるが、  それは今度は", "わさ゛わさ゛めーるて゛おしえてくれることもあるか゛、それはこんと゛は", "チェーン・メールとなる。", "ちぇーん・めーるとなる。"]
}
, {kind:"I", lines:["(2) チェーン・メール"]
}
, {kind:"q", lines:["チェーン・メールとは、人から  人へと  連鎖的に    送られる  うちに、", "ちぇーん・めーるとは、ひとからひとへとれんさてきにおくられるうちに、", "メールの総数が      ふくれ上がる  ようなものを言う。つまり、不幸の", "めーるのそうすうか゛ふくれあか゛るようなものをいう。つまり、ふこうの", "手紙の    ようなもので  ある。これも最近は    手が  こんで  きて、", "てか゛みのようなものて゛ある。これもさいきんはてか゛こんて゛きて、", "上で    述べたような  ウィルス情報、        当たり屋の車の    ナンバー", "うえて゛のへ゛たようなうぃるすし゛ょうほう、あたりやのくるまのなんは゛ー", "一覧、    瓶の    フタを集めると  ボランティアの  資金に  なります、", "いちらん、ひ゛んのふたをあつめるとほ゛らんてぃあのしきんになります、", "といった、人の  善意に    つけこんで  広がる    ものも多い。", "といった、ひとのせ゛んいにつけこんて゛ひろか゛るものもおおい。"]
}
, {kind:"I", lines:["(3) ウィルスの補足"]
}
, {kind:"q", lines:["メールを読んだ  だけで    感染する    ウィルスはない、と書いたが、", "めーるをよんた゛た゛けて゛かんせんするうぃるすはない、とかいたか゛、", "これには例外が        ある。これはマクロ・ウィルスというもので、", "これにはれいか゛いか゛ある。これはまくろ・うぃるすというものて゛、", "表計算        などの  データの  マクロに潜んで    いる。感染した", "ひょうけいさんなと゛のて゛ーたのまくろにひそんて゛いる。かんせんした", "データを  メールに貼りつけて送ると、  読んだ  側で      自動的に", "て゛ーたをめーるにはりつけておくると、よんた゛か゛わて゛し゛と゛うてきに", "マクロが  動き    出し、  感染する    というものである。  米国", "まくろか゛うこ゛きた゛し、かんせんするというものて゛ある。へ゛いこく", "某社の      ワープロ、  表計算        ソフトを使っている  人は", "ほ゛うしゃのわーふ゜ろ、ひょうけいさんそふとをつかっているひとは", "注意した    方が    いいだろう。", "ちゅういしたほうか゛いいた゛ろう。"]
}
]
, keytype:"k", num:"2"}
, {course:"j", data:[{kind:"T", lines:["                            Lesson J2", "", "電子メールとか、ウィルスとか。", ""]
}
, {kind:"I", lines:["(1) ウィルス"]
}
, {kind:"q", lines:["これこれというサブジェクトの    メールを読むとコンピュータ  ・ウィルスに", "これこれというさふ゛し゛ぇくとのめーるをよむとこんひ゜ゅーた・うぃるすに", "感染    する、といった噂を    耳にする  ことがある。  これはまったくの", "かんせんする、といったうわさをみみにすることか゛ある。これはまったくの", "デマ  で  ある。原理的に、      メールを読んだ  だけ  で  感染", "て゛まて゛ある。け゛んりてきに、めーるをよんた゛た゛けて゛かんせん", "するようなウィルスはあり得ない。友達      が  親切心      から", "するようなうぃるすはありえない。ともた゛ちか゛しんせつしんから", "わざわざ    メールで  教えて  くれることもあるが、  それは今度は", "わさ゛わさ゛めーるて゛おしえてくれることもあるか゛、それはこんと゛は", "チェーン・メールとなる。", "ちぇーん・めーるとなる。"]
}
, {kind:"I", lines:["(2) チェーン・メール"]
}
, {kind:"q", lines:["チェーン・メールとは、人から  人へと  連鎖的に    送られる  うちに、", "ちぇーん・めーるとは、ひとからひとへとれんさてきにおくられるうちに、", "メールの総数が      ふくれ上がる  ようなものを言う。つまり、不幸の", "めーるのそうすうか゛ふくれあか゛るようなものをいう。つまり、ふこうの", "手紙の    ようなもので  ある。これも最近は    手が  こんで  きて、", "てか゛みのようなものて゛ある。これもさいきんはてか゛こんて゛きて、", "上で    述べたような  ウィルス情報、        当たり屋の車の    ナンバー", "うえて゛のへ゛たようなうぃるすし゛ょうほう、あたりやのくるまのなんは゛ー", "一覧、    瓶の    フタを集めると  ボランティアの  資金に  なります、", "いちらん、ひ゛んのふたをあつめるとほ゛らんてぃあのしきんになります、", "といった、人の  善意に    つけこんで  広がる    ものも多い。", "といった、ひとのせ゛んいにつけこんて゛ひろか゛るものもおおい。"]
}
, {kind:"I", lines:["(3) ウィルスの補足"]
}
, {kind:"q", lines:["メールを読んだ  だけで    感染する    ウィルスはない、と書いたが、", "めーるをよんた゛た゛けて゛かんせんするうぃるすはない、とかいたか゛、", "これには例外が        ある。これはマクロ・ウィルスというもので、", "これにはれいか゛いか゛ある。これはまくろ・うぃるすというものて゛、", "表計算        などの  データの  マクロに潜んで    いる。感染した", "ひょうけいさんなと゛のて゛ーたのまくろにひそんて゛いる。かんせんした", "データを  メールに貼りつけて送ると、  読んだ  側で      自動的に", "て゛ーたをめーるにはりつけておくると、よんた゛か゛わて゛し゛と゛うてきに", "マクロが  動き    出し、  感染する    というものである。  米国", "まくろか゛うこ゛きた゛し、かんせんするというものて゛ある。へ゛いこく", "某社の      ワープロ、  表計算        ソフトを使っている  人は", "ほ゛うしゃのわーふ゜ろ、ひょうけいさんそふとをつかっているひとは", "注意した    方が    いいだろう。", "ちゅういしたほうか゛いいた゛ろう。"]
}
]
, keytype:"j", num:"2"}
]
;
