if (!this["Typist_lesson_data"]) Typist_lesson_data = {};
Typist_lesson_data["k"] = [{course:"k", data:[{kind:"T", lines:["これはキーボードのテスト用です。練習用レッスンではありません。"]
}
, {kind:"I", lines:["106キーボード"]
}
, {kind:"k", lines:["1 2 3 4 5 6 7 8 9 0 - ^ \\ # $ % & ' ( ) ~", "ぬふあうえおやゆよわほへーぁぅぇぉゃゅょを", "q w e r t y u i o p @ [ a s d f g h j k l ; : ]", "たていすかんなにらせ゛゜ちとしはきくまのりれけむ", "z x c v b n m , . / \\ E Z < > ? { }", "つさそひこみもねるめろぃっ、。・「」"]
}
, {kind:"I", lines:["101キーボード"]
}
, {kind:"k", lines:["1 2 3 4 5 6 7 8 9 0 - = # $ % ^ & * ( )", "ぬふあうえおやゆよわほ゜ぁぅぇぉゃゅょを", "q w e r t y u i o p [ ] } a s d f g h j k l ; '", "たていすかんなにらせへむーちとしはきくまのりれけ", "z x c v b n m , . / : \" E Z < > ? + {", "つさそひこみもねるめ゛ろぃっ、。・「」"]
}
, {kind:"T", lines:["ここで ^C か ^F を入力。"]
}
]
, keytype:"ejk", num:"20"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K7", "", "", "このレッスンでは、新しく「う」「え」「お」と「や」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。指先を見てはいけません。"]
}
, {kind:"K", lines:["もりの  こりす  のこりの  このみは  みんな  かくす", "まいにち  まんいんの  しんかいそく  かなり  かこく", "かみそりに  まいこん  くみこみ  すこしも  そりのこしなし"]
}
, {kind:"I", lines:["「う」は4のキーで、Fに置いている左人差し指を伸ばして押します。"]
}
, {kind:"K", lines:["ははは  ううう  ははは  ううう  はうはう  うはうは"]
}
, {kind:"K", lines:["ははは  ううう  はうはう  はすう  はうす  うすは", "はうはう  はすはす  はうはう  はかはか  はうはう"]
}
, {kind:"I", lines:["「う」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["うみは  そうとう  うねり  そうなんき  みうしなう"]
}
, {kind:"I", lines:["「や」は7のキーで、Jに置いている右人差し指を伸ばして押します。"]
}
, {kind:"K", lines:["ままま  ややや  ままま  ややや  まやまや  やまやま"]
}
, {kind:"K", lines:["ままま  ややや  まやまや  まなやま  まやなま  まなやま", "まやまや  まなまな  まやまや  まんまん  まやまや"]
}
, {kind:"I", lines:["「や」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["やきにくや  やすみ  くやしい  しんやの  やきいもや"]
}
, {kind:"I", lines:["「え」は5のキーで、Fに置いている左人差し指を伸ばして押します。"]
}
, {kind:"K", lines:["ははは  えええ  ははは  えええ  はえはえ  えはえは"]
}
, {kind:"K", lines:["ははは  えええ  はえはえ  はえす  はすえ  すえは  はえす", "はえはえ  はすはす  はうはう  はえはえ  はかはか  はえはえ"]
}
, {kind:"I", lines:["「え」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["とえい  ちかえき  きんえんに  きりかえ  まきかえし"]
}
, {kind:"I", lines:["「お」は6のキーで、Jに置いている右人差し指を伸ばして押します。"]
}
, {kind:"K", lines:["ままま  おおお  ままま  おおお  まおまお  おまおま"]
}
, {kind:"K", lines:["ままま  おおお  ままま  おおお  まんお  まおん  おんま", "まおまお  まなまな  まやまや  まおまお  まんまん  まおまお"]
}
, {kind:"I", lines:["「お」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["すなおな  おとこ  おんなに  おおきな  おかしの  おくりもの"]
}
, {kind:"I", lines:["例によって意味のない単語を。"]
}
, {kind:"K", lines:["やみの  まおう  いえんに  なやみ  こうやくはり  はやねはやおき", "うみのいえに  やまおとこ  みやこおちの  かなしい  みのうえ"]
}
, {kind:"I", lines:["スピード練習。"]
}
, {kind:"Q", lines:["おやおもいの  そうかいや  ははおやに  なんおくえんも  しおくり", "おかやまの  やまおくに  やそうえん  のうやくのない  はちうえ", "おいしい  おすしや  やきとりも  やはり  くやしい  こうないえん"]
}
]
, keytype:"ejk", num:"7"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K16", "", "", "ここでは新しく「ぁ」「ぃ」「ぅ」「ぇ」「ぉ」の練習をします。", "", "これらの文字は、主に外来語などの表記で使いますが、通常の日本語では、そう", "頻繁には利用されないでしょう。従って、スピードは重要ではありません。", "もし、これらの文字が頻繁に出て来るのであれば、それがどこにあるのか、見な", "くても自然に覚えられるでしょう。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"k", lines:["マッキントッシュ  チュートリアル  キャスター  ペンション", "まっきんとっしゅ  ちゅーとりある  きゃすたー  へ゜んしょん", "チョップ    キャッシュ  オプショナルツアー    スチュワーデス", "ちょっふ゜  きゃっしゅ  おふ゜しょなるつあー  すちゅわーて゛す"]
}
, {kind:"I", lines:["「ぁ」は、右シフトキーを押しながら、左中指で3のキーを押します。"]
}
, {kind:"K", lines:["ししし  ぁぁぁ  ししし  ぁぁぁ  しし  ぁぁ  しぁ  ぁし"]
}
, {kind:"I", lines:["「ぁ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["しいぁ  しあぁ  いぁし  しぁあ  あいぁ  しぁい  しいぁ"]
}
, {kind:"k", lines:["ファイバー    グァム    ファイル  ヴァイオリン    ファッション", "ふぁいは゛ー  く゛ぁむ  ふぁいる  う゛ぁいおりん  ふぁっしょん"]
}
, {kind:"I", lines:["「ぃ」は、右シフトキーを押しながら、左中指でEのキーを押します。"]
}
, {kind:"K", lines:["ししし  ぃぃぃ  ししし  ぃぃぃ  しし  ぃぃ  しぃ  ぃし"]
}
, {kind:"I", lines:["「ぃ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["しぃあ  しあぃ  いしぁ  しそぃ  そあぃ  あぃし  ぃあぃ"]
}
, {kind:"k", lines:["ウィンドウ    オフィス  ティファニー  トレンディ    ヴィーナス", "うぃんと゛う  おふぃす  てぃふぁにー  とれんて゛ぃ  う゛ぃーなす"]
}
, {kind:"I", lines:["「ぅ」は、右シフトキーを押しながら、左人差し指で4のキーを押します。"]
}
, {kind:"K", lines:["ははは  ぅぅぅ  ははは  ぅぅぅ  はは  ぅぅ  はぅ  ぅは"]
}
, {kind:"I", lines:["「ぅ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["はすぅ  はぅす  すぅは  はかぅ  ひはぅ  すはぅ  きぅは"]
}
, {kind:"k", lines:["トゥナイト  ドゥーム    トゥルー  アンドゥ    トンブクトゥ", "とぅないと  と゛ぅーむ  とぅるー  あんと゛ぅ  とんふ゛くとぅ"]
}
, {kind:"I", lines:["「ぇ」は、右シフトキーを押しながら、左人差し指で5のキーを押します。"]
}
, {kind:"K", lines:["ははは  ぇぇぇ  ははは  ぇぇぇ  はは  ぇぇ  はぇ  ぇは"]
}
, {kind:"I", lines:["「ぇ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["はすぇ  はかぇ  すぇか  はぇき  きはぇ  かぇす  すぇき"]
}
, {kind:"k", lines:["ハードウェア    チェック  オブジェクト      エフェクト  イェティ", "はーと゛うぇあ  ちぇっく  おふ゛し゛ぇくと  えふぇくと  いぇてぃ"]
}
, {kind:"I", lines:["「ぉ」は、左シフトキーを押しながら、左人差し指で6のキーを押します。"]
}
, {kind:"K", lines:["ままま  ぉぉぉ  ままま  ぉぉぉ  まま  ぉぉ  まぉ  ぉま"]
}
, {kind:"I", lines:["「ぉ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["まなぉ  まんぉ  なんぉ  まくぉ  なぉく  んぉな  まぉん"]
}
, {kind:"k", lines:["フォーマル  クォーク  ウォッチ  ヘッドフォン    ウォーク", "ふぉーまる  くぉーく  うぉっち  へっと゛ふぉん  うぉーく"]
}
, {kind:"I", lines:["有名な作曲家の名前を入力しましょう。"]
}
, {kind:"k", lines:["ベートーヴェン      モーツァルト  ショスタコーヴィチ", "へ゛ーとーう゛ぇん  もーつぁると  しょすたこーう゛ぃち", "グバイドゥーリナ        ドヴォルザーク", "く゛は゛いと゛ぅーりな  と゛う゛ぉるさ゛ーく"]
}
]
, keytype:"ejk", num:"16"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K10", "", "", "このレッスンでは、新しく「さ」「る」「つ」と「め」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["のにゆ  われせ  にゆの  のゆに  しあい  れせわ", "あいそ  りよら  しいあ  りらよ  よらり  わせれ"]
}
, {kind:"K", lines:["いたりあの  いんてりあようひんの  もよおしもの  かなり  わりやす", "かたわらの  わいん  のみ  よゆうの  わらいに  ひとあんしん"]
}
, {kind:"I", lines:["「さ」はXのキーで、Sに置いている左薬指で押します。"]
}
, {kind:"K", lines:["ととと  さささ  ととと  さささ  とと  ささ  とさ  さと"]
}
, {kind:"I", lines:["「さ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["とさとさ  とてとて  とさて  さてと  てとさ  さとて  てさと"]
}
, {kind:"K", lines:["いささか  うさんくさい  しさんうんように  さいきん  そうさ"]
}
, {kind:"I", lines:["「る」は「.」のキーで、Lに置いている右薬指を使います。"]
}
, {kind:"K", lines:["りりり  るるる  りりり  るるる  りり  るる  りる  るり"]
}
, {kind:"I", lines:["「る」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["りるりる  りらりら  りるりる  りよりよ  りるりる", "りらよ  りるら  りよら  るりら  りるよ  りよる"]
}
, {kind:"K", lines:["はるやすみ  まひるの  あかるい  のやま  あるきまわる"]
}
, {kind:"I", lines:["「つ」はZのキーで、Aに置いている左小指を使います。"]
}
, {kind:"K", lines:["ちちち  つつつ  ちちち  つつつ  ちち  つつ  ちつ  つち"]
}
, {kind:"I", lines:["「つ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちつちつ  ちたちた  ちつた  ちたつ  たちつ  たつち  つたち"]
}
, {kind:"K", lines:["なつやすみの  あついよる  みつあみのこ  つれて  なつまつりに"]
}
, {kind:"I", lines:["「め」は「/」のキーで、「;」に置いている右小指を使います。"]
}
, {kind:"K", lines:["れれれ  めめめ  れれれ  めめめ  れれ  めめ  れめ  めれ"]
}
, {kind:"I", lines:["「め」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れめれめ  れせれせ  れめれめ  れわれわ  れめれめ", "れめせ  れせわ  れせめ  わせめ  せれめ  めれわ"]
}
, {kind:"K", lines:["ゆうめいな  にまいめ  めいたんてい  きめては  ひらめき  めいすいり"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["きつねの  よめいり  ひるひなか  あかるいのに  あめもよう", "さいかいはつの  いきさつ  こんさるたんとに  せつめいさせる"]
}
, {kind:"I", lines:["このレッスンはこれで終わり。"]
}
, {kind:"K", lines:["はつゆめに  たか  なす  するめ  かめ  さる  なんとなく  しりめつれつ", "もらるのなさ  しめす  めいわくな  しつないの  きつえん  やめさせよう"]
}
]
, keytype:"ejk", num:"10"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K11", "", "", "ここまでで、かなりのキーを覚えました。", "このレッスンでは、新しく「け」「ふ」と「ほ」の練習をします。", "ここから、右小指の負担が増えてきます。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["るりら  さてと  わせめ  りらよ  めれわ  つたち", "りよる  ちつた  とさて  せれめ  れせわ  さとて"]
}
, {kind:"K", lines:["さいしんさくは  なつめそうせきの  めいさくの  さるまね  まるうつし", "あついなか  かたくるしい  あいさつ  おつとめ  おつかれさま"]
}
, {kind:"I", lines:["「け」は「'」のキーで、「;」に置いている右小指を動かして押します。"]
}
, {kind:"K", lines:["れれれ  けけけ  れれれ  けけけ  れれ  けけ  れけ  けれ"]
}
, {kind:"I", lines:["「け」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れけれけ  れせれせ  れけれけ  れめれめ  れけれけ", "れけせ  れせめ  けれせ  けめれ  れわれ  けれわ"]
}
, {kind:"K", lines:["けんけつの  うけつけ  けつあつと  ひんけつけんさ  けいこくうける"]
}
, {kind:"I", lines:["「ふ」は2のキーで、Sに置いている左薬指を伸ばして押します。"]
}
, {kind:"K", lines:["ととと  ふふふ  ととと  ふふふ  とと  ふふ  とふ  ふと"]
}
, {kind:"I", lines:["「ふ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["とふとふ  とてとて  とふとふ  とさとさ  とふとふ", "とてふ  とさて  てとふ  とふて  さてと  とてふ  てふと"]
}
, {kind:"K", lines:["ふらんすふうの  ふゆふくの  ふたりは  ふうすいし  ふうふ"]
}
, {kind:"I", lines:["「ほ」は「-」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  ほほほ  れれれ  ほほほ  れれ  ほほ  れほ  ほれ"]
}
, {kind:"I", lines:["「ほ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れほれほ  れせれせ  れほれほ  れわれわ  れほれほ  れめれめ", "れほれほ  れけれけ  れほれほ  れせれせ  れほれほ  れわれわ"]
}
, {kind:"K", lines:["れせほ  れわほ  れけほ  せれほ  せわほ  せけれ", "せほわ  ほせれ  れせけ  れけほ  せれわ  せわほ"]
}
, {kind:"I", lines:["小指が疲れてしまいましたか？"]
}
, {kind:"K", lines:["ほらあなの  まほうつかい  ほしまわり  みて  ひほうの  ようい"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["けいほうきなり  けんけいの  ふけいさん  ふたり  かけつけた", "ほしふるよる  よふけに  ほんとうに  きれいな  ほくとしちせい"]
}
, {kind:"I", lines:["スピード練習。"]
}
, {kind:"Q", lines:["けんていの  ほんしけんは  ふほんいな  せいせき  とほうにくれる", "けいけんほうふな  ほけんふさん  けんこうかいふくに  ほししいたけ", "いみふめいな  ふりつけに  ふまんたらたら  ふんいき  けんあく"]
}
]
, keytype:"e", num:"11"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K11", "", "", "ここまでで、かなりのキーを覚えました。", "このレッスンでは、新しく「け」「ふ」と「ほ」の練習をします。", "ここから、右小指の負担が増えてきます。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["るりら  さてと  わせめ  りらよ  めれわ  つたち", "りよる  ちつた  とさて  せれめ  れせわ  さとて"]
}
, {kind:"K", lines:["さいしんさくは  なつめそうせきの  めいさくの  さるまね  まるうつし", "あついなか  かたくるしい  あいさつ  おつとめ  おつかれさま"]
}
, {kind:"I", lines:["「け」は「:」のキーで、「;」に置いている右小指を動かして押します。"]
}
, {kind:"K", lines:["れれれ  けけけ  れれれ  けけけ  れれ  けけ  れけ  けれ"]
}
, {kind:"I", lines:["「け」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れけれけ  れせれせ  れけれけ  れめれめ  れけれけ", "れけせ  れせめ  けれせ  けめれ  れわれ  けれわ"]
}
, {kind:"K", lines:["けんけつの  うけつけ  けつあつと  ひんけつけんさ  けいこくうける"]
}
, {kind:"I", lines:["「ふ」は2のキーで、Sに置いている左薬指を伸ばして押します。"]
}
, {kind:"K", lines:["ととと  ふふふ  ととと  ふふふ  とと  ふふ  とふ  ふと"]
}
, {kind:"I", lines:["「ふ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["とふとふ  とてとて  とふとふ  とさとさ  とふとふ", "とてふ  とさて  てとふ  とふて  さてと  とてふ  てふと"]
}
, {kind:"K", lines:["ふらんすふうの  ふゆふくの  ふたりは  ふうすいし  ふうふ"]
}
, {kind:"I", lines:["「ほ」は「-」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  ほほほ  れれれ  ほほほ  れれ  ほほ  れほ  ほれ"]
}
, {kind:"I", lines:["「ほ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れほれほ  れせれせ  れほれほ  れわれわ  れほれほ  れめれめ", "れほれほ  れけれけ  れほれほ  れせれせ  れほれほ  れわれわ"]
}
, {kind:"K", lines:["れせほ  れわほ  れけほ  せれほ  せわほ  せけれ", "せほわ  ほせれ  れせけ  れけほ  せれわ  せわほ"]
}
, {kind:"I", lines:["小指が疲れてしまいましたか？"]
}
, {kind:"K", lines:["ほらあなの  まほうつかい  ほしまわり  みて  ひほうの  ようい"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["けいほうきなり  けんけいの  ふけいさん  ふたり  かけつけた", "ほしふるよる  よふけに  ほんとうに  きれいな  ほくとしちせい"]
}
, {kind:"I", lines:["スピード練習。"]
}
, {kind:"Q", lines:["けんていの  ほんしけんは  ふほんいな  せいせき  とほうにくれる", "けいけんほうふな  ほけんふさん  けんこうかいふくに  ほししいたけ", "いみふめいな  ふりつけに  ふまんたらたら  ふんいき  けんあく"]
}
]
, keytype:"jk", num:"11"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K17", "", "", "このレッスンが最後のレッスンです。ここでは括弧、つまり「 と 」、および", "中点「・」を打つ練習をします。", "これらの文字を含む文書を打っていて、そのキーの位置が分からなかったら、", "キーを目で捜してもかまいません。しかし、そのキーはつねに正しい指でタイプ", "するようにします。"]
}
, {kind:"I", lines:["まず、復習。作曲家の名前です。"]
}
, {kind:"k", lines:["ドビュッシー      ストラヴィンスキー    ヴァレーズ", "と゛ひ゛ゅっしー  すとらう゛ぃんすきー  う゛ぁれーす゛", "シェーンベルク    マルティヌー  ウェーベルン    ウォルトン", "しぇーんへ゛るく  まるてぃぬー  うぇーへ゛るん  うぉるとん"]
}
, {kind:"I", lines:["左括弧「 は、左シフトキーを押しながら右小指で = のキーを押します。"]
}
, {kind:"K", lines:["れれれ  「「「  れれれ  「「「  れれ  「「  れ「  「れ"]
}
, {kind:"I", lines:["右括弧 」は、左シフトキーを押しながら右小指で [ のキーを押します。"]
}
, {kind:"K", lines:["れれれ  」」」  れれれ  」」」  れれ  」」  れ」  」れ"]
}
, {kind:"K", lines:["れ「れ」  「け」  「ち」  「た」  「つ」  「かっこ」"]
}
, {kind:"k", lines:["「狛犬」は    「高麗の犬」      で、  元は  「獅子」だったという。", "「こまいぬ」は「こうらいのいぬ」て゛、もとは「しし」た゛ったという。"]
}
, {kind:"I", lines:["「・」は左シフトキーを押しながら、「/」を右小指で押します。"]
}
, {kind:"K", lines:["れれれ  ・・・  れれれ  ・・・  れれ  ・・  れ・  ・れ"]
}
, {kind:"I", lines:["「・」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れ・れ  れめ・  れ・け  せれ・  め・れ  れせ・  れ・め"]
}
, {kind:"k", lines:["マン・マシン・インタフェース  パ・ド・ドゥ        ツイン・ピークス", "まん・ましん・いんたふぇーす  は゜・と゛・と゛ぅ  ついん・ひ゜ーくす"]
}
, {kind:"k", lines:["サン・サーンス  リヒャルト・シュトラウス  クララ・シューマン", "さん・さーんす  りひゃると・しゅとらうす  くらら・しゅーまん"]
}
, {kind:"T", lines:["                                おわりに", "", "これでKコースは終わりです。この後は、さらにJコースを練習することができるで", "しょう。また、まだアルファベットの練習をしていない人は、ぜひTコースなどで", "練習をして下さい。", "", "まだ学んでいないキーが少々残っています。これらをタッチタイピングで入力しよ", "うとするならば、そのキーに一番近い指を使うことです。従って、ESC、TABなどは", "Aの指を使います。右の方にある、Deleteなどは「;」の指を使います。", "", "キーボードによっては、Alternateキー、Commandキーなどがありますが、これらは", "左右に備わっていますから、タッチタイピングを応用することも可能でしょう。"]
}
]
, keytype:"e", num:"17"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K17", "", "", "このレッスンが最後のレッスンです。ここでは括弧、つまり「 と 」、および", "中点「・」を打つ練習をします。", "これらの文字を含む文書を打っていて、そのキーの位置が分からなかったら、", "キーを目で捜してもかまいません。しかし、そのキーはつねに正しい指でタイプ", "するようにします。"]
}
, {kind:"I", lines:["まず、復習。作曲家の名前です。"]
}
, {kind:"k", lines:["ドビュッシー      ストラヴィンスキー    ヴァレーズ", "と゛ひ゛ゅっしー  すとらう゛ぃんすきー  う゛ぁれーす゛", "シェーンベルク    マルティヌー  ウェーベルン    ウォルトン", "しぇーんへ゛るく  まるてぃぬー  うぇーへ゛るん  うぉるとん"]
}
, {kind:"I", lines:["左括弧「 は、左シフトキーを押しながら右小指で [ のキーを押します。"]
}
, {kind:"K", lines:["れれれ  「「「  れれれ  「「「  れれ  「「  れ「  「れ"]
}
, {kind:"I", lines:["右括弧 」は、左シフトキーを押しながら右小指で ] のキーを押します。"]
}
, {kind:"K", lines:["れれれ  」」」  れれれ  」」」  れれ  」」  れ」  」れ"]
}
, {kind:"K", lines:["れ「れ」  「け」  「ち」  「た」  「つ」  「かっこ」"]
}
, {kind:"k", lines:["「狛犬」は    「高麗の犬」      で、  元は  「獅子」だったという。", "「こまいぬ」は「こうらいのいぬ」て゛、もとは「しし」た゛ったという。"]
}
, {kind:"I", lines:["「・」は左シフトキーを押しながら、「/」を右小指で押します。"]
}
, {kind:"K", lines:["れれれ  ・・・  れれれ  ・・・  れれ  ・・  れ・  ・れ"]
}
, {kind:"I", lines:["「・」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れ・れ  れめ・  れ・け  せれ・  め・れ  れせ・  れ・め"]
}
, {kind:"k", lines:["マン・マシン・インタフェース  パ・ド・ドゥ        ツイン・ピークス", "まん・ましん・いんたふぇーす  は゜・と゛・と゛ぅ  ついん・ひ゜ーくす"]
}
, {kind:"k", lines:["サン・サーンス  リヒャルト・シュトラウス  クララ・シューマン", "さん・さーんす  りひゃると・しゅとらうす  くらら・しゅーまん"]
}
, {kind:"T", lines:["                                おわりに", "", "これでKコースは終わりです。この後は、さらにJコースを練習することができるで", "しょう。また、まだアルファベットの練習をしていない人は、ぜひTコースなどで", "練習をして下さい。", "", "まだ学んでいないキーが少々残っています。これらをタッチタイピングで入力しよ", "うとするならば、そのキーに一番近い指を使うことです。従って、ESC、TABなどは", "Aの指を使います。右の方にある、Deleteなどは「;」の指を使います。", "", "キーボードによっては、Alternateキー、Commandキーなどがありますが、これらは", "左右に備わっていますから、タッチタイピングを応用することも可能でしょう。"]
}
]
, keytype:"jk", num:"17"}
, {course:"k", data:[{kind:"T", lines:["                              Lesson K2", "", "", "このレッスンでは、ホームポジションの残りの文字を覚えます。"]
}
, {kind:"I", lines:["レッスン1の復習から。指先を見てはいけません。"]
}
, {kind:"K", lines:["ままはは  はまはま  はまは  まはま  ままは  ははま"]
}
, {kind:"I", lines:["左の中指をDのキーの上に置き、「し」を入力します。"]
}
, {kind:"K", lines:["ししし  ししし  ししし  しし  しし  しし  し  し"]
}
, {kind:"I", lines:["右の中指をKのキーの上に置き、「の」を入力します。"]
}
, {kind:"K", lines:["ののの  ののの  ののの  のの  のの  のの  の  の"]
}
, {kind:"I", lines:["両方一緒に。"]
}
, {kind:"K", lines:["ししし  ののの  しし  のの  しのし  のしの  ししし  ののの"]
}
, {kind:"I", lines:["薬指はS、Lのキーの上に置き、「と」、「り」を入力します。"]
}
, {kind:"K", lines:["ととと  りりり  ととと  りりり  とと  りり  とと  りり  と  り"]
}
, {kind:"I", lines:["小指はA、;のキーの上に置き、「ち」、「れ」を入力します。"]
}
, {kind:"K", lines:["ちちち  れれれ  ちちち  れれれ  ちち  れれ  ちち  れれ  ち  れ"]
}
, {kind:"I", lines:["ここまでを復習してみましょう。"]
}
, {kind:"K", lines:["ははは  ままま  ししし  ののの  ととと  りりり  ちちち  れれれ"]
}
, {kind:"I", lines:["全部一緒に。"]
}
, {kind:"K", lines:["ちとしは  まのりれ  しはとち  まりれの  とはちし  のりまれ"]
}
, {kind:"K", lines:["りれまはし  ちのしはま  とちりまれ  のりとのち  しとはれと"]
}
, {kind:"I", lines:["終わる前に、いくつかの単語をタイプしましょう。"]
}
, {kind:"K", lines:["ちち  はは  まま  のり  とれ  ちり  はし", "はと  しまの  まちは  はれ  のち  とまと", "はち  はしり  とまれ  のれ  とりしまり"]
}
]
, keytype:"ejk", num:"2"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K9", "", "", "このレッスンでは、新しく「あ」「ゆ」「よ」と「わ」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["とてとて  ちたちた  りらりら  れせれせ  たてせら  てらたせ", "らいせんす  いはんから  しはらいせきにん  ていたく  ていとうに"]
}
, {kind:"K", lines:["おたからは  にせものと  かんてい  そのしらせに  ひとはらん"]
}
, {kind:"I", lines:["「ゆ」は8のキーで、Kに置いている右中指を伸ばして押します。"]
}
, {kind:"K", lines:["ののの  ゆゆゆ  ののの  ゆゆゆ  のの  ゆゆ  のゆのゆ  ゆのゆの"]
}
, {kind:"I", lines:["「ゆ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["のゆのゆ  のにのに  のゆのゆ  のねのね  にゆにゆ  のゆのゆ", "のにゆ  のゆの  のねに  にゆの  ねのに  のゆの  にねの"]
}
, {kind:"K", lines:["ゆうれいやくの  はいゆうは  なりゆきから  ゆかたのまま  ゆうはん"]
}
, {kind:"I", lines:["「あ」は3のキーで、Dに置いている左中指を伸ばして押します。"]
}
, {kind:"K", lines:["ししし  あああ  ししし  あああ  しし  ああ  しあしあ  あしあし"]
}
, {kind:"I", lines:["「あ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["しあしあ  しいしい  しあしあ  しそしそ  いあいあ  しあしあ", "しいあ  しあい  あいし  しそし  そいあ  あいし  あいそ"]
}
, {kind:"K", lines:["あしたの  あいての  てあらな  しあい  まのあたりにして  ひやあせ"]
}
, {kind:"I", lines:["「よ」は9のキーで、Lに置いている右薬指を伸ばして押します。"]
}
, {kind:"K", lines:["りりり  よよよ  りりり  よよよ  りり  よよ  りよりよ  よりより"]
}
, {kind:"I", lines:["「よ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["りよりよ  りらりら  りよら  りらよ  よりら  よらり  りよりよ"]
}
, {kind:"K", lines:["やみよに  よみちに  まよいこみ  まよなか  いような  ようかい"]
}
, {kind:"I", lines:["「わ」は0のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  わわわ  れれれ  わわわ  れれ  わわ  れわ  われ"]
}
, {kind:"I", lines:["「わ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れわれわ  れせれせ  れせわ  れわせ  わせれ  せわれ  われせ"]
}
, {kind:"K", lines:["わかものたち  おきなわに  わたり  かわいい  うきわの  わすれもの"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["しんゆうと  まちあわせて  ゆうえんちに  ゆく  うちあわせ", "あすの  よせんの  くみあわせ  よわい  われわれ  よわねはく"]
}
, {kind:"I", lines:["もうすこし練習。"]
}
, {kind:"K", lines:["よいやみの  よやくせき  おみあい  あいてに  あいそわらい", "はれわたり  はなやかな  よそおい  えんゆうかいは  わきあいあい"]
}
]
, keytype:"ejk", num:"9"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K15", "", "", "このレッスンでは、新しく拗音の「ゃ」「ゅ」「ょ」、および長音記号「ー」の", "練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"k", lines:["マジッククラブの    実績は      さっぱりで、    廃部の    ピンチ", "まし゛っくくらふ゛のし゛っせきはさっは゜りて゛、はいふ゛のひ゜んち。", "水鉄砲に、            目一杯      水を    入れてまっすぐ  飛ばそう。", "みす゛て゛っほ゜うに、めいっは゜いみす゛をいれてまっすく゛とは゛そう。"]
}
, {kind:"I", lines:["「ゃ」は、左シフトキーを押しながら、右人差し指で7のキーを押します。"]
}
, {kind:"K", lines:["ままま  ややや  ゃゃゃ  ままま  ゃゃゃ  まま  ゃゃ  まゃ  ゃま"]
}
, {kind:"I", lines:["「ゃ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["まやな  まゃな  なまゃ  まなゃ  まんゃ  なやま  んゃま  まゃな"]
}
, {kind:"k", lines:["百貨店        お客さん      シャツ  ジャングル      戦略", "ひゃっかてん  おきゃくさん  しゃつ  し゛ゃんく゛る  せんりゃく"]
}
, {kind:"I", lines:["「ゅ」は、左シフトキーを押しながら、右中指で8のキーを押します。"]
}
, {kind:"K", lines:["ののの  ゆゆゆ  ゅゅゅ  ののの  ゅゅゅ  のの  ゅゅ  のゅ  ゅの"]
}
, {kind:"I", lines:["「ゅ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["のゆに  のゅに  にのゅ  のにゅ  のゆに  のねゅ  にゅの"]
}
, {kind:"k", lines:["吸収中              牛乳            一角獣            誤謬", "きゅうしゅうちゅう  き゛ゅうにゅう  いっかくし゛ゅう  こ゛ひ゛ゅう"]
}
, {kind:"I", lines:["「ょ」は、左シフトキーを押しながら、右薬指で9のキーを押します。"]
}
, {kind:"K", lines:["りりり  よよよ  ょょょ  りりり  ょょょ  りり  ょょ  りょ  ょり"]
}
, {kind:"I", lines:["「ょ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["りらよ  りょら  らりょ  りるら  よりら  りらょ  らょり"]
}
, {kind:"k", lines:["三拍子          兄弟          表彰状                増長", "さんひ゛ょうし  きょうた゛い  ひょうしょうし゛ょう  そ゛うちょう"]
}
, {kind:"I", lines:["「ー」は左シフトキーを押しながら、「]」を右小指で押します。"]
}
, {kind:"K", lines:["れれれ  ーーー  れれれ  ーーー  れれ  ーー  れー  ーれ"]
}
, {kind:"K", lines:["れけー  れむー  れろー  むれー  れへー  ろれー  れーへ"]
}
, {kind:"k", lines:["ローラースケート  ユーロビート    スーパーマン    チーズケーキ", "ろーらーすけーと  ゆーろひ゛ーと  すーは゜ーまん  ちーす゛けーき"]
}
, {kind:"I", lines:["最後に外来語で練習。"]
}
, {kind:"k", lines:["ニューヨーク  チョコレート  コマーシャル  コミュニケーション", "にゅーよーく  ちょこれーと  こまーしゃる  こみゅにけーしょん", "シュークリーム  マネージャー    ギャラリー    メーキャップ", "しゅーくりーむ  まねーし゛ゃー  き゛ゃらりー  めーきゃっふ゜"]
}
]
, keytype:"e", num:"15"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K15", "", "", "このレッスンでは、新しく拗音の「ゃ」「ゅ」「ょ」、および長音記号「ー」の", "練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"k", lines:["マジッククラブの    実績は      さっぱりで、    廃部の    ピンチ", "まし゛っくくらふ゛のし゛っせきはさっは゜りて゛、はいふ゛のひ゜んち。", "水鉄砲に、            目一杯      水を    入れてまっすぐ  飛ばそう。", "みす゛て゛っほ゜うに、めいっは゜いみす゛をいれてまっすく゛とは゛そう。"]
}
, {kind:"I", lines:["「ゃ」は、左シフトキーを押しながら、右人差し指で7のキーを押します。"]
}
, {kind:"K", lines:["ままま  ややや  ゃゃゃ  ままま  ゃゃゃ  まま  ゃゃ  まゃ  ゃま"]
}
, {kind:"I", lines:["「ゃ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["まやな  まゃな  なまゃ  まなゃ  まんゃ  なやま  んゃま  まゃな"]
}
, {kind:"k", lines:["百貨店        お客さん      シャツ  ジャングル      戦略", "ひゃっかてん  おきゃくさん  しゃつ  し゛ゃんく゛る  せんりゃく"]
}
, {kind:"I", lines:["「ゅ」は、左シフトキーを押しながら、右中指で8のキーを押します。"]
}
, {kind:"K", lines:["ののの  ゆゆゆ  ゅゅゅ  ののの  ゅゅゅ  のの  ゅゅ  のゅ  ゅの"]
}
, {kind:"I", lines:["「ゅ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["のゆに  のゅに  にのゅ  のにゅ  のゆに  のねゅ  にゅの"]
}
, {kind:"k", lines:["吸収中              牛乳            一角獣            誤謬", "きゅうしゅうちゅう  き゛ゅうにゅう  いっかくし゛ゅう  こ゛ひ゛ゅう"]
}
, {kind:"I", lines:["「ょ」は、左シフトキーを押しながら、右薬指で9のキーを押します。"]
}
, {kind:"K", lines:["りりり  よよよ  ょょょ  りりり  ょょょ  りり  ょょ  りょ  ょり"]
}
, {kind:"I", lines:["「ょ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["りらよ  りょら  らりょ  りるら  よりら  りらょ  らょり"]
}
, {kind:"k", lines:["三拍子          兄弟          表彰状                増長", "さんひ゛ょうし  きょうた゛い  ひょうしょうし゛ょう  そ゛うちょう"]
}
, {kind:"I", lines:["「ー」は右小指を伸ばし、BackSpace(Delete)キーの左隣のキーを押します。"]
}
, {kind:"K", lines:["れれれ  ーーー  れれれ  ーーー  れれ  ーー  れー  ーれ"]
}
, {kind:"K", lines:["れけー  れーけ  れせー  せれー  れへー  ほれー  れーへ"]
}
, {kind:"k", lines:["ローラースケート  ユーロビート    スーパーマン    チーズケーキ", "ろーらーすけーと  ゆーろひ゛ーと  すーは゜ーまん  ちーす゛けーき"]
}
, {kind:"I", lines:["最後に外来語で練習。"]
}
, {kind:"k", lines:["ニューヨーク  チョコレート  コマーシャル  コミュニケーション", "にゅーよーく  ちょこれーと  こまーしゃる  こみゅにけーしょん", "シュークリーム  マネージャー    ギャラリー    メーキャップ", "しゅーくりーむ  まねーし゛ゃー  き゛ゃらりー  めーきゃっふ゜"]
}
]
, keytype:"jk", num:"15"}
, {course:"k", data:[{kind:"T", lines:["                              Lesson K3", "", "", "このレッスンでは、すでに学んだ文字の復習と、新しい文字「い」「き」「く」", "および「に」の練習をします。", "", "これらの文字のために指を伸ばしても、必ずホームポジションに戻るようにして", "下さい。例えば「く」はHのキーですが、このキーを打つためには右の人差し指", "を少し左に動かし、「く」のキーを押したらすぐにJの上に指を戻します。", "", "指がどこにあるのかわからなくなる事もあるでしょう。しかし、決して指先を見", "てはいけません。"]
}
, {kind:"I", lines:["まず復習。"]
}
, {kind:"K", lines:["ちとはし  りまれの  としはち  りまれの  とちしは  まのりれ"]
}
, {kind:"K", lines:["ちち  はは  まま  はし  のり  しち  とれ  とまと", "はと  まち  はれ  のち  まり  はち  とし  はれま"]
}
, {kind:"I", lines:["「く」はHのキーで、「ま」と同じく右人差し指を使います。"]
}
, {kind:"K", lines:["ままま  くくく  ままま  くくく  まま  くく  まく  くま"]
}
, {kind:"K", lines:["まま  くく  まく  まち  くち  くし  とまと  はくし"]
}
, {kind:"I", lines:["「き」はGのキーで、「は」と同じく左人差し指を使います。"]
}
, {kind:"K", lines:["ははは  ききき  ははは  ききき  はは  きき  はき  きは"]
}
, {kind:"K", lines:["ははは  ききき  はきはき  きく  はり  きり  はまのきく"]
}
, {kind:"I", lines:["「い」はEのキーで、Dに置いている中指を使います。"]
}
, {kind:"K", lines:["ししし  いいい  ししし  いいい  しし  いい  しい  いし"]
}
, {kind:"K", lines:["ししし  いいい  しましま  いく  いし  しまい  いまいく"]
}
, {kind:"I", lines:["「に」はIのキーで、Kに置いている中指を使います。"]
}
, {kind:"K", lines:["ののの  ににに  ののの  ににに  のの  にに  のに  にの"]
}
, {kind:"K", lines:["ののの  ににに  のちに  くにの  にしのちに  いくのに"]
}
, {kind:"I", lines:["全部一緒に。"]
}
, {kind:"K", lines:["いくにい  きいくに  きにきい  くきいき  くにいく  きにくに"]
}
, {kind:"K", lines:["いしくには  きりのくに  きれいにき  くとはいき  くまにいく"]
}
, {kind:"I", lines:["おしまいに、意味のないいくつかの単語をタイプしましょう。"]
}
, {kind:"K", lines:["はいとくの  くのいち  しまい  しれい  きき  いのきに  にくはく", "とくに  といれは  きれい  はちまきの  はくし  まいにち  とくい"]
}
]
, keytype:"ejk", num:"3"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K5", "", "", "このレッスンでは、新しく「か」「ん」「ひ」および「も」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["ははは  すすす  ままま  ななな  ししし  そそそ  ののの  ねねね", "はまなす  すなはま  しそのね  のねしそ  すちすと  なれなり"]
}
, {kind:"K", lines:["そのとき  しまねの  すなはまに  れいすいきと  はなの  くすり", "すとれす  すいま  ねいき  そいね  その  ねまき  いりますね"]
}
, {kind:"I", lines:["「か」はTのキーで、Fに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ははは  かかか  ははは  かかか  はは  かか  はか  かは"]
}
, {kind:"K", lines:["ははは  かかか  はきはき  はかはか  はすはす  はかはか", "はきはか  はすはか  はすはき  はきはか  はかはす  はきはか"]
}
, {kind:"K", lines:["かかしの  きかいかは  かなりの  いしきかいかく  いねかりします"]
}
, {kind:"I", lines:["「ん」はYのキーで、Jに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ままま  んんん  ままま  んんん  まま  んん  まん  んま"]
}
, {kind:"K", lines:["ままま  んんん  まくまく  まんまん  まなまな  まんまん", "まんまく  まんまな  まくまな  まんまく  まなまん  まくまん"]
}
, {kind:"K", lines:["きんりんの  いいんに  しんはんにん  なんなく  なんきん"]
}
, {kind:"I", lines:["「ひ」はVのキーで、Fに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ははは  ひひひ  ははは  ひひひ  はは  ひひ  はひ  ひは"]
}
, {kind:"K", lines:["ははは  ひひひ  はきはき  はひはひ  はすはす  はひはひ", "はひはき  はひはす  はかはひ  はきはひ  はかはき  はひはす"]
}
, {kind:"K", lines:["ひとり  ひととき  ひちりき  ひのとり  ははのひ  ひすい"]
}
, {kind:"I", lines:["「も」はMのキーで、Jに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ままま  ももも  ままま  ももも  まま  もも  まも  もま"]
}
, {kind:"K", lines:["ままま  ももも  まくまく  まもまも  まなまな  まもまも", "まもまく  まもまな  まんまも  まなまく  まくまん  まなまも"]
}
, {kind:"K", lines:["すももの  もりの  まもの  まもなく  もとの  いきものに"]
}
, {kind:"I", lines:["例によって意味のない単語を。指先を見てはいけません。"]
}
, {kind:"K", lines:["もものはな  まんかい  ひとり  ひそかに  もなかの  かいもの", "かれんな  しまい  かいりきの  まものも  なんなく  ひとひねり"]
}
, {kind:"T", lines:["                        スピード練習", "", "これから、レッスンの中にスピード練習を混ぜることにします。これまでの練習", "では、正しくタイプできるまで繰り返し入力させていましたが、スピード練習で", "は、テキストを一度表示するだけにします。", "", "何が違うかというと、時間の計測をする点が異なります。行の最初の文字をタイ", "プしてから最後の改行を打つまでの時間が計測されます。タイプし終わったら、", "毎分に入力できる単語数(語/分:WPM)という形で入力スピードが計算されます。", "また、誤りの数も数えて、総数を表示します。", "", "タイプ間違いをした時には、音を出し、誤った部分を強調表示します。どんどん", "打ち続けて、できるだけ間違いが少なくなるように頑張って下さい。"]
}
, {kind:"T", lines:["                        バックスペース／Deleteキー", "", "ほとんどのプログラムでは、間違った入力はバックスペース、あるいは Deleteキー", "で修正できます。これらのキーはたいてい、直前に打った文字を消去します。", "", "このレッスンの間は、これらのキーを使わないようにすべきだと思います。正しく", "タイプできるまで繰り返し練習するべきなのです。", "しかし、スピード練習の時には、これらのキーを使う事もできるようにはしてあり", "ます。（エラーのマークは消えますが、Deleteもエラーに含めてカウントします）", "", "もし、バックスペースや Deleteキーを使う場合は、「;」の指を使って打ち、すぐ", "にホームポジションに戻るようにします。"]
}
, {kind:"I", lines:["最後にスピード練習"]
}
, {kind:"Q", lines:["ひんしの  とくはいん  なんにちかんも  ちかそしきに  かんきん", "そのひとの  れいかんに  ちんもくし  ひとしきり  かんしん", "のんきな  くまの  かんきちは  ひのきの  もりの  にんきもの"]
}
]
, keytype:"ejk", num:"5"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K12", "", "", "このレッスンでは、新しく「へ」「ぬ」と「む」の練習をします。", "ここから、キーボードの違いによってキー配置が違うものも出てきます。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけせ  てとふ  けめれ  けれわ  てふと  れけほ", "とてふ  とふて  けれせ  れせほ  れわほ  せれほ"]
}
, {kind:"K", lines:["ふくそかいせきの  ほこう  わすれ  しけんもわるくて  たんい  ふそくに", "ほんやく  そふとに  ほうふな  きのう  わるい  わほうには  けいこく"]
}
, {kind:"I", lines:["「へ」は「[」のキーで、「;」に置いている右小指を動かして押します。"]
}
, {kind:"K", lines:["れれれ  へへへ  れれれ  へへへ  れれ  へへ  れへ  へれ"]
}
, {kind:"I", lines:["「へ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れへれへ  れせれせ  れへれへ  れわれわ  れへれへ  れほれほ", "れへれへ  れけれけ  れへれへ  れほれほ  れへれへ  れわれわ"]
}
, {kind:"K", lines:["れせへ  れほへ  れほわ  せれへ  せほへ  れけへ", "せへれ  れせほ  れせへ  れけへ  せれわ  れほへ"]
}
, {kind:"K", lines:["ちへいせんの  かなたへ  ひへいした  へいしから  たいへんな  ふへい"]
}
, {kind:"I", lines:["「ぬ」は1のキーで、Aに置いている左小指を伸ばして打ちます。"]
}
, {kind:"K", lines:["ちちち  ぬぬぬ  ちちち  ぬぬぬ  ちち  ぬぬ  ちぬ  ぬち"]
}
, {kind:"I", lines:["「ぬ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちぬちぬ  ちたちた  ちぬちぬ  ちつちつ  ちぬちぬ", "ちたぬ  ちぬた  ちつた  たぬち  つちぬ  ちつぬ"]
}
, {kind:"K", lines:["ぬけめない  いちみに  つつぬけ  ぬけあな  とおりぬけ  もぬけのから"]
}
, {kind:"I", lines:["「む」は「]」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  むむむ  れれれ  むむむ  れれ  むむ  れむ  むれ"]
}
, {kind:"I", lines:["「む」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れむれむ  れけれけ  れむれむ  れへれへ  れむれむ", "れけむ  れむけ  れへけ  けむれ  めれむ  れむけ"]
}
, {kind:"K", lines:["むしんけいな  むすめむこは  むしあつくて  うつむいて  いねむり"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["よわむし  けむしの  こしぬけ  むすこは  へりくつは  いちにんまえ", "かいへいたいの  しんへいき  ぬすむ  にんむ  たいへん  むつかしい"]
}
, {kind:"I", lines:["このレッスンはこれで終わり。"]
}
, {kind:"K", lines:["おもてむきは  へいせい  よそおい  わへいのための  たいわへ  むかう  ", "はえぬきの  せんむ  なまぬるい  ほうこくの  てぬき  みぬく"]
}
]
, keytype:"e", num:"12"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K12", "", "", "このレッスンでは、新しく「へ」「ぬ」と「む」の練習をします。", "ここから、キーボードの違いによってキー配置が違うものも出てきます。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけせ  てとふ  けめれ  けれわ  てふと  れけほ", "とてふ  とふて  けれせ  れせほ  れわほ  せれほ"]
}
, {kind:"K", lines:["ふくそかいせきの  ほこう  わすれ  しけんもわるくて  たんい  ふそくに", "ほんやく  そふとに  ほうふな  きのう  わるい  わほうには  けいこく"]
}
, {kind:"I", lines:["「へ」は「^」のキーで、「;」に置いている右小指を動かして押します。"]
}
, {kind:"K", lines:["れれれ  へへへ  れれれ  へへへ  れれ  へへ  れへ  へれ"]
}
, {kind:"I", lines:["「へ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れへれへ  れせれせ  れへれへ  れわれわ  れへれへ  れほれほ", "れへれへ  れけれけ  れへれへ  れほれほ  れへれへ  れわれわ"]
}
, {kind:"K", lines:["れせへ  れほへ  れほわ  せれへ  せほへ  れけへ", "せへれ  れせほ  れせへ  れけへ  せれわ  れほへ"]
}
, {kind:"K", lines:["ちへいせんの  かなたへ  ひへいした  へいしから  たいへんな  ふへい"]
}
, {kind:"I", lines:["「ぬ」は1のキーで、Aに置いている左小指を伸ばして打ちます。"]
}
, {kind:"K", lines:["ちちち  ぬぬぬ  ちちち  ぬぬぬ  ちち  ぬぬ  ちぬ  ぬち"]
}
, {kind:"I", lines:["「ぬ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちぬちぬ  ちたちた  ちぬちぬ  ちつちつ  ちぬちぬ", "ちたぬ  ちぬた  ちつた  たぬち  つちぬ  ちつぬ"]
}
, {kind:"K", lines:["ぬけめない  いちみに  つつぬけ  ぬけあな  とおりぬけ  もぬけのから"]
}
, {kind:"I", lines:["「む」は「]」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  むむむ  れれれ  むむむ  れれ  むむ  れむ  むれ"]
}
, {kind:"I", lines:["「む」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れむれむ  れけれけ  れむれむ  れせれせ  れむれむ", "れけむ  れむけ  れせけ  けむれ  めれむ  れむけ"]
}
, {kind:"K", lines:["むしんけいな  むすめむこは  むしあつくて  うつむいて  いねむり"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["よわむし  けむしの  こしぬけ  むすこは  へりくつは  いちにんまえ", "かいへいたいの  しんへいき  ぬすむ  にんむ  たいへん  むつかしい"]
}
, {kind:"I", lines:["このレッスンはこれで終わり。"]
}
, {kind:"K", lines:["おもてむきは  へいせい  よそおい  わへいのための  たいわへ  むかう  ", "はえぬきの  せんむ  なまぬるい  ほうこくの  てぬき  みぬく"]
}
]
, keytype:"k", num:"12"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K12", "", "", "このレッスンでは、新しく「へ」「ぬ」と「む」の練習をします。", "ここから、キーボードの違いによってキー配置が違うものも出てきます。", "", "「ほ」「へ」「む」、それから後で出てくる「ろ」は、ホームポジションから", "少し離れています。最初のうちはキーを目で見ないと打てないかもしれません", "が、できるだけ見ないで打てるように練習しましょう。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけせ  てとふ  けめれ  けれわ  てふと  れけほ", "とてふ  とふて  けれせ  れせほ  れわほ  せれほ"]
}
, {kind:"K", lines:["ふくそかいせきの  ほこう  わすれ  しけんもわるくて  たんい  ふそくに", "ほんやく  そふとに  ほうふな  きのう  わるい  わほうには  けいこく"]
}
, {kind:"I", lines:["「へ」は「^」のキーで、「;」に置いている右小指を動かして押します。"]
}
, {kind:"K", lines:["れれれ  へへへ  れれれ  へへへ  れれ  へへ  れへ  へれ"]
}
, {kind:"I", lines:["「へ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れへれへ  れせれせ  れへれへ  れわれわ  れへれへ  れほれほ", "れへれへ  れけれけ  れへれへ  れほれほ  れへれへ  れわれわ"]
}
, {kind:"K", lines:["れせへ  れほへ  れほわ  せれへ  せほへ  れけへ", "せへれ  れせほ  れせへ  れけへ  せれわ  れほへ"]
}
, {kind:"K", lines:["ちへいせんの  かなたへ  ひへいした  へいしから  たいへんな  ふへい"]
}
, {kind:"I", lines:["「ぬ」は1のキーで、Aに置いている左小指を伸ばして打ちます。"]
}
, {kind:"K", lines:["ちちち  ぬぬぬ  ちちち  ぬぬぬ  ちち  ぬぬ  ちぬ  ぬち"]
}
, {kind:"I", lines:["「ぬ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちぬちぬ  ちたちた  ちぬちぬ  ちつちつ  ちぬちぬ", "ちたぬ  ちぬた  ちつた  たぬち  つちぬ  ちつぬ"]
}
, {kind:"K", lines:["ぬけめない  いちみに  つつぬけ  ぬけあな  とおりぬけ  もぬけのから"]
}
, {kind:"I", lines:["「む」は「]」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  むむむ  れれれ  むむむ  れれ  むむ  れむ  むれ"]
}
, {kind:"I", lines:["「む」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れむれむ  れけれけ  れむれむ  れせれせ  れむれむ", "れけむ  れむけ  れせけ  けむれ  めれむ  れむけ"]
}
, {kind:"K", lines:["むしんけいな  むすめむこは  むしあつくて  うつむいて  いねむり"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["よわむし  けむしの  こしぬけ  むすこは  へりくつは  いちにんまえ", "かいへいたいの  しんへいき  ぬすむ  にんむ  たいへん  むつかしい"]
}
, {kind:"I", lines:["このレッスンはこれで終わり。"]
}
, {kind:"K", lines:["おもてむきは  へいせい  よそおい  わへいのための  たいわへ  むかう  ", "はえぬきの  せんむ  なまぬるい  ほうこくの  てぬき  みぬく"]
}
]
, keytype:"j", num:"12"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K8", "", "", "このレッスンでは、新しく「た」「て」「ら」と「せ」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["はうす  かえは  はうはう  はきはき  はえはえ", "まなや  まおん  まおまお  まくまく  まやまや"]
}
, {kind:"K", lines:["えきまえの  やおや  としうえの  おんなのひとと  こんやく", "うまい  おおきな  おこのみやき  そのうえ  かなりやすい"]
}
, {kind:"I", lines:["「て」はWのキーで、Sに置いている左薬指で押します。"]
}
, {kind:"K", lines:["ととと  ててて  ととと  ててて  とと  てて  とてとて  てとてと"]
}
, {kind:"I", lines:["「て」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["そくていちの  こてんてき  ていしきかに  ひていてきな  してき"]
}
, {kind:"K", lines:["ていこくの  しきてんに  こうてい  すててこ  はいていく"]
}
, {kind:"I", lines:["「ら」はO(オー)のキーで、Lに置いている右薬指で押します。"]
}
, {kind:"K", lines:["りりり  ららら  りりり  ららら  りり  らら  りらりら  らりらり"]
}
, {kind:"I", lines:["「ら」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["きらくな  かれらから  それいらい  れんらくなく  いらいら"]
}
, {kind:"K", lines:["みはらしのいい  れすとらん  うらやまから  ねらう  からす"]
}
, {kind:"I", lines:["「た」はQのキーで、Aに置いている左小指を伸ばして押します。"]
}
, {kind:"K", lines:["ちちち  たたた  ちちち  たたた  ちち  たた  ちたちた  たちたち"]
}
, {kind:"I", lines:["「た」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["たたかう  たいいんたちの  きたえた  にくたいは  たいしたもの"]
}
, {kind:"K", lines:["たちまち  はたん  やくにたたない  かんたくは  はんたいたすう"]
}
, {kind:"I", lines:["「せ」はPのキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  せせせ  れれれ  せせせ  れれ  せせ  れせれせ  せれせれ"]
}
, {kind:"I", lines:["「せ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["きしかいせいの  しんせいひん  すうせんおくうり  せかいせいは"]
}
, {kind:"K", lines:["こうせいせきの  せいと  こうしきせんに  えんせいし  せきはい"]
}
, {kind:"I", lines:["あまり意味のない文章で練習。"]
}
, {kind:"K", lines:["かいせいの  そらみて  せんたくしたら  はなうた  うたいたいくらい", "せいらい  らくてんてきな  せいかくは  かれらとは  せいはんたい"]
}
, {kind:"I", lines:["このレッスンはこれで終わり。"]
}
, {kind:"K", lines:["こせいてきな  てんらんかい  きたいしたのに  ひたすら  らくたん", "こてきたい  せんせいに  にらまれ  しかたなく  せいりせいとん"]
}
]
, keytype:"ejk", num:"8"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K14", "", "", "このレッスンでは、新しく促音の「っ」、および「゛」（濁点）、", "「゜」（半濁点）の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["かみを、きる。つるを、おる。つえを、つく。ことを、ひく。", "いろんをとなえ、とうろんをおこない、はんろんし、くろうする。"]
}
, {kind:"T", lines:["                        右のシフトキー", "", "このレッスンの「っ」や、あとのレッスンで練習する「ぁ」などの小さな字は、", "右シフトキーを押しながら入力する必要があります。", "左手側にある文字をシフトキーをおしながら入力するには:", "", "        a. 右小指をシフトキーの上まで伸ばしてそれを押します。この時、右", "           人差し指はできるだけJの上から動かさないように心がけます。", "", "        b. 左手で目的のキーを押します。", "", "        c. 右小指を;キーの上に素早く戻します。"]
}
, {kind:"I", lines:["「っ」は右シフトキーを押しながら、左小指でZを押します。"]
}
, {kind:"K", lines:["ちちち  っっっ  ちちち  っっっ  ちち  っっ  ちっ  っち"]
}
, {kind:"I", lines:["「っ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちっちっ  つっつっ  ちっちっ  れっれっ  ろっろっ  ちっちっ", "ちっち  れっち  たっち  つっつ  ろっち  たっつ  れっつ"]
}
, {kind:"K", lines:["さっき、あっちに  ひっしに  はしって  いったのは、きっと  かれ。"]
}
, {kind:"T", lines:["                        濁点と半濁点", "", "typistでは、例えば、「が」は「か゛」のように表示し、練習でも「か」と", "「゛」を続けて入力するようにしています。通常の日本語入力でも、「か」と", "「゛」を続けて入力すると、自動的に「が」が表示されるようになっています", "ので、実際のタイピングでは問題はありません。"]
}
, {kind:"I", lines:["「゛」はシフトキーを押しながら、「;」のキーを右小指で押します。"]
}
, {kind:"K", lines:["れれれ  ゛゛゛  れれれ  ゛゛゛  れれ  ゛゛  れ゛  ゛れ"]
}
, {kind:"K", lines:["れ゛れ゛  せ゛せ゛  れ゛れ゛  ち゛ち゛  け゛け゛  れ゛れ゛", "た゛た゛  れ゛れ゛  つ゛つ゛  け゛け゛  せ゛せ゛  た゛た゛"]
}
, {kind:"I", lines:["カタカナには「ヴ」がありますが、ひらがなにはありません。"]
}
, {kind:"K", lines:["か゛き゛く゛け゛こ゛  さ゛し゛す゛せ゛そ゛  う゛", "た゛ち゛つ゛て゛と゛  は゛ひ゛ふ゛へ゛ほ゛  う゛"]
}
, {kind:"T", lines:["                        漢字かなまじり文の表示", "", "以下の練習では、いままでのように空白で文節を区切らず、代わりにその文の通", "常の漢字かなまじり表記を同時に表示させることがあります。漢字かなまじり表", "記は文の内容をわかりやすく表すだけで、練習内容に直接影響はしません。"]
}
, {kind:"k", lines:["江戸時代は、        井戸端会議が            大事な      場で    あった。", "えと゛し゛た゛いは、いと゛は゛たかいき゛か゛た゛いし゛なは゛て゛あった。", "事務手続き      での  番号が、          原簿と      だいぶ    違う。", "し゛むてつつ゛きて゛のは゛んこ゛うか゛、け゛んほ゛とた゛いふ゛ちか゛う。"]
}
, {kind:"I", lines:["「゜」は「=」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  ゜゜゜  れれれ  ゜゜゜  れれ  ゜゜  れ゜  ゜れ"]
}
, {kind:"I", lines:["「゜」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れ゜れ゜  は゜は゜  ひ゜ひ゜  ふ゜ふ゜  れ゜れ゜", "れ゜れ゜  へ゜へ゜  は゜は゜  ほ゜ほ゜  れ゜れ゜"]
}
, {kind:"K", lines:["ひ゜んほ゜んた゛ま  は゜いなっふ゜る  ふ゜ろへ゜ら  ほ゜っふ゜す", "へ゜んき゛ん  ふ゜ろは゜ん  ほ゜りへ゜ふ゜ちと゛  は゜んふ゜きん"]
}
, {kind:"k", lines:["日本の      大臣の        発言は、      根本的に        勘違い。", "にっほ゜んのた゛いし゛んのはつけ゛んは、こんほ゜んてきにかんちか゛い。", "管弦楽団の              トランペットは、  失敗すると      目立ちます。", "かんけ゛んか゛くた゛んのとらんへ゜っとは、しっは゜いするとめた゛ちます。"]
}
]
, keytype:"e", num:"14"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K14", "", "", "このレッスンでは、新しく促音の「っ」、および「゛」（濁点）、", "「゜」（半濁点）の練習をします。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["かみを、きる。つるを、おる。つえを、つく。ことを、ひく。", "いろんをとなえ、とうろんをおこない、はんろんし、くろうする。"]
}
, {kind:"T", lines:["                        右のシフトキー", "", "このレッスンの「っ」や、あとのレッスンで練習する「ぁ」などの小さな字は、", "右シフトキーを押しながら入力する必要があります。", "左手側にある文字をシフトキーをおしながら入力するには:", "", "        a. 右小指をシフトキーの上まで伸ばしてそれを押します。この時、右", "           人差し指はできるだけJの上から動かさないように心がけます。", "", "        b. 左手で目的のキーを押します。", "", "        c. 右小指を;キーの上に素早く戻します。"]
}
, {kind:"I", lines:["「っ」は右シフトキーを押しながら、左小指でZを押します。"]
}
, {kind:"K", lines:["ちちち  っっっ  ちちち  っっっ  ちち  っっ  ちっ  っち"]
}
, {kind:"I", lines:["「っ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちっちっ  つっつっ  ちっちっ  れっれっ  ろっろっ  ちっちっ", "ちっち  れっち  たっち  つっつ  ろっち  たっつ  れっつ"]
}
, {kind:"K", lines:["さっき、あっちに  ひっしに  はしって  いったのは、きっと  かれ。"]
}
, {kind:"T", lines:["                        濁点と半濁点", "", "typistでは、例えば、「が」は「か゛」のように表示し、練習でも「か」と", "「゛」を続けて入力するようにしています。通常の日本語入力でも、「か」と", "「゛」を続けて入力すると、自動的に「が」が表示されるようになっています", "ので、実際のタイピングでは問題はありません。"]
}
, {kind:"I", lines:["「゛」は「@」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  ゛゛゛  れれれ  ゛゛゛  れれ  ゛゛  れ゛  ゛れ"]
}
, {kind:"I", lines:["「゛」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れ゛れ゛  せ゛せ゛  れ゛れ゛  ち゛ち゛  け゛け゛  れ゛れ゛", "た゛た゛  れ゛れ゛  つ゛つ゛  け゛け゛  せ゛せ゛  た゛た゛"]
}
, {kind:"I", lines:["カタカナには「ヴ」がありますが、ひらがなにはありません。"]
}
, {kind:"K", lines:["か゛き゛く゛け゛こ゛  さ゛し゛す゛せ゛そ゛  う゛", "た゛ち゛つ゛て゛と゛  は゛ひ゛ふ゛へ゛ほ゛  う゛"]
}
, {kind:"T", lines:["                        漢字かなまじり文の表示", "", "以下の練習では、いままでのように空白で文節を区切らず、代わりにその文の通", "常の漢字かなまじり表記を同時に表示させることがあります。漢字かなまじり表", "記は文の内容をわかりやすく表すだけで、練習内容に直接影響はしません。"]
}
, {kind:"k", lines:["江戸時代は、        井戸端会議が            大事な      場で    あった。", "えと゛し゛た゛いは、いと゛は゛たかいき゛か゛た゛いし゛なは゛て゛あった。", "事務手続き      での  番号が、          原簿と      だいぶ    違う。", "し゛むてつつ゛きて゛のは゛んこ゛うか゛、け゛んほ゛とた゛いふ゛ちか゛う。"]
}
, {kind:"I", lines:["「゜」は「[」のキーで、「;」に置いている右小指を伸ばして押します。"]
}
, {kind:"K", lines:["れれれ  ゜゜゜  れれれ  ゜゜゜  れれ  ゜゜  れ゜  ゜れ"]
}
, {kind:"I", lines:["「゜」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れ゜れ゜  は゜は゜  ひ゜ひ゜  ふ゜ふ゜  れ゜れ゜", "れ゜れ゜  へ゜へ゜  は゜は゜  ほ゜ほ゜  れ゜れ゜"]
}
, {kind:"K", lines:["ひ゜んほ゜んた゛ま  は゜いなっふ゜る  ふ゜ろへ゜ら  ほ゜っふ゜す", "へ゜んき゛ん  ふ゜ろは゜ん  ほ゜りへ゜ふ゜ちと゛  は゜んふ゜きん"]
}
, {kind:"k", lines:["日本の      大臣の        発言は、      根本的に        勘違い。", "にっほ゜んのた゛いし゛んのはつけ゛んは、こんほ゜んてきにかんちか゛い。", "管弦楽団の              トランペットは、  失敗すると      目立ちます。", "かんけ゛んか゛くた゛んのとらんへ゜っとは、しっは゜いするとめた゛ちます。"]
}
]
, keytype:"jk", num:"14"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K6", "", "", "このレッスンでは、新しく「こ」と「み」の練習をします。"]
}
, {kind:"I", lines:["まず復習から。指先を見てはいけません。"]
}
, {kind:"K", lines:["ははは  かかか  ははは  ひひひ  ままま  んんん  ままま  ももも", "はかはひ  はきはす  はかはひ  まんまも  まくまな  まんまも"]
}
, {kind:"K", lines:["しもんきかん  ひそかに  とりひき  りねんもなく  はくしいにん", "れきしりかい  いいはり  はんとしちかくも  ないかく  ひはん"]
}
, {kind:"I", lines:["「み」はNのキーで、Jに置いている右人差し指を使います。"]
}
, {kind:"K", lines:["ままま  みみみ  ままま  みみみ  まみまみ  みまみま", "まみまみ  まくまく  まみまみ  まなまな"]
}
, {kind:"K", lines:["まみまみ  まもまも  まみまみ  まんまん", "ままま  みみみ  ままま  みみみ  まみまみ  みまみま"]
}
, {kind:"K", lines:["しみん  みんな  すみれ  みまもり  なみきみちは  ちかみち"]
}
, {kind:"I", lines:["「こ」はBのキーで、少し遠いですが、Fに置いている左人差し指を使います。"]
}
, {kind:"K", lines:["ははは  こここ  ははは  こここ  はこはこ  こはこは", "はこはこ  はきはき  はこはこ  はかはか  はこはこ"]
}
, {kind:"K", lines:["はこはこ  はすはす  はこはこ  はひはひ  はこはこ", "ははは  こここ  ははは  こここ  はこはこ  こはこは"]
}
, {kind:"K", lines:["かしこい  こりす  きれいな  ことり  いのこり  こねこ"]
}
, {kind:"I", lines:["例によって意味のない単語を。指先を見てはいけません。"]
}
, {kind:"K", lines:["みなみちくに  ひとり  はいりこみ  ことこまかに  ききこみ", "みこんの  いとこの  かみかくしに  そんみん  みんな  ちまなこ"]
}
, {kind:"I", lines:["最後にスピード練習"]
}
, {kind:"Q", lines:["なみまに  いきのこりの  なんみんと  のりくみいん  きのみきのまま", "ことしこそ  こくみんねんきん  かいかくしないと  しんこくに", "いちもんの  かいりき  りきし  なんとか  かちこしの  みこみ"]
}
]
, keytype:"ejk", num:"6"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K13", "", "", "このレッスンでは、新しく「を」「ろ」および句読点「、」「。」の練習をし", "ます。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけむ  れほへ  ちたぬ  ちぬた  れせへ  けむれ", "つちぬ  めれむ  れへほ  たぬち  せほへ  れむけ"]
}
, {kind:"K", lines:["そのさむらいは  てきへいの  わな  みぬき  ひそかに  ぬけみちへ", "へいそから  ていけつあつの  むすめ  おきぬけは  まぬけな  かお"]
}
, {kind:"T", lines:["                        左のシフトキー", "", "このレッスンの「を」や句読点、あとのレッスンで練習する促音や拗音の小さな", "字は、シフトキーを押しながら入力する必要があります。", "右手側にある文字を左シフトキーを押しながら入力するには:", "", "        1. Aの指を左シフトキーの上に移動させて押します。この時、右人差し", "           指はできるだけFの上から動かさないように心がけます。", "", "        2. 右手で目的のキーを押します。", "", "        3. Aの指は素早くホームポジションに戻します。"]
}
, {kind:"I", lines:["「を」は左シフトキーを押しながら、右小指で0（ゼロ）を押します。"]
}
, {kind:"K", lines:["れれれ  ををを  れれれ  ををを  れれ  をを  れを  をれ"]
}
, {kind:"I", lines:["「を」を押したら、左右の小指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちれを  たちせれを  つちめれを  ちけれを", "けむちを  つけを  むたを  ちせを  ためを"]
}
, {kind:"K", lines:["とをあける  うたをうたう  いぬをかう  こいをする  ゆめをみる"]
}
, {kind:"K", lines:["ふくをきる  くつをはく  かおをあらう  ほんをかう  かさをさす"]
}
, {kind:"I", lines:["「ろ」は左シフトキーを押しながら、右小指で「'」を押します。"]
}
, {kind:"K", lines:["れれれ  ろろろ  れれれ  ろろろ  れれ  ろろ  れろ  ろれ"]
}
, {kind:"I", lines:["「ろ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れろれろ  れけれけ  れろれろ  れめれめ  れろれろ", "れけろ  れめろ  けろれ  けれろ  ろれめ  ろけれ"]
}
, {kind:"K", lines:["ひろんりてきな  ろんしに  ろんそうあいての  おろかさ  ろてい"]
}
, {kind:"I", lines:["読点「、」は左シフトキーを押しながら、右中指で「,」を押します。"]
}
, {kind:"K", lines:["ののの  、、、  ののの  、、、  のの  、、  の、  、の"]
}
, {kind:"I", lines:["「、」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["の、の、  のねのね  の、の、  のにのに  の、の、", "の、に  のに、  のにゆ  、のに  、のゆ  のに、"]
}
, {kind:"K", lines:["ろくおんしたのに、さいせい、うまくいかない、るすろくも、おかしい"]
}
, {kind:"I", lines:["句点「。」は左シフトキーを押しながら、右薬指で「.」を押します。"]
}
, {kind:"K", lines:["りりり  。。。  りりり  。。。  りり  。。  り。  。り"]
}
, {kind:"I", lines:["「。」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["り。り。  りるりる  り。り。  りらりら  り。り。", "り。る  りら。  る。り  。るら  りら。  るり。"]
}
, {kind:"K", lines:["ほしをみる。はなをつむ。さけをのむ。ふえをふく。みちをゆく。"]
}
, {kind:"I", lines:["最後にスピード練習で、このレッスンは終わり。"]
}
, {kind:"Q", lines:["はたを、ふる。いろを、ぬる。つちを、ほる。さらを、わる。むりを、いう。", "かたを、たたく。こしを、さする。かねを、ひろう。おゆを、さます。"]
}
]
, keytype:"e", num:"13"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K13", "", "", "このレッスンでは、新しく「を」「ろ」および句読点「、」「。」の練習をし", "ます。", "これ以降、国産パソコンを使っている人は、必ず「カナ」キーを押した状態に", "して練習して下さい。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけむ  れほへ  ちたぬ  ちぬた  れせへ  けむれ", "つちぬ  めれむ  れへほ  たぬち  せほへ  れむけ"]
}
, {kind:"K", lines:["そのさむらいは  てきへいの  わな  みぬき  ひそかに  ぬけみちへ", "へいそから  ていけつあつの  むすめ  おきぬけは  まぬけな  かお"]
}
, {kind:"T", lines:["                        左のシフトキー", "", "このレッスンの「を」や句読点、あとのレッスンで練習する促音や拗音の小さな", "字は、シフトキーを押しながら入力する必要があります。", "右手側にある文字を左シフトキーを押しながら入力するには:", "", "        1. Aの指を左シフトキーの上に移動させて押します。この時、右人差し", "           指はできるだけFの上から動かさないように心がけます。", "", "        2. 右手で目的のキーを押します。", "", "        3. Aの指は素早くホームポジションに戻します。"]
}
, {kind:"I", lines:["「を」は左シフトキーを押しながら、右小指で0（ゼロ）を押します。"]
}
, {kind:"K", lines:["れれれ  ををを  れれれ  ををを  れれ  をを  れを  をれ"]
}
, {kind:"I", lines:["「を」を押したら、左右の小指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちれを  たちせれを  つちめれを  ちけれを", "けむちを  つけを  むたを  ちせを  ためを"]
}
, {kind:"K", lines:["とをあける  うたをうたう  いぬをかう  こいをする  ゆめをみる"]
}
, {kind:"K", lines:["ふくをきる  くつをはく  かおをあらう  ほんをかう  かさをさす"]
}
, {kind:"I", lines:["「ろ」は右シフトキーの隣の「ロ」のキーを右小指で押します。"]
}
, {kind:"K", lines:["れれれ  ろろろ  れれれ  ろろろ  れれ  ろろ  れろ  ろれ"]
}
, {kind:"I", lines:["「ろ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れろれろ  れけれけ  れろれろ  れめれめ  れろれろ", "れけろ  れめろ  けろれ  けれろ  ろれめ  ろけれ"]
}
, {kind:"K", lines:["ひろんりてきな  ろんしに  ろんそうあいての  おろかさ  ろてい"]
}
, {kind:"I", lines:["読点「、」は左シフトキーを押しながら、右中指で「,」を押します。"]
}
, {kind:"K", lines:["ののの  、、、  ののの  、、、  のの  、、  の、  、の"]
}
, {kind:"I", lines:["「、」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["の、の、  のねのね  の、の、  のにのに  の、の、", "の、に  のに、  のにゆ  、のに  、のゆ  のに、"]
}
, {kind:"K", lines:["ろくおんしたのに、さいせい、うまくいかない、るすろくも、おかしい"]
}
, {kind:"I", lines:["句点「。」は左シフトキーを押しながら、右薬指で「.」を押します。"]
}
, {kind:"K", lines:["りりり  。。。  りりり  。。。  りり  。。  り。  。り"]
}
, {kind:"I", lines:["「。」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["り。り。  りるりる  り。り。  りらりら  り。り。", "り。る  りら。  る。り  。るら  りら。  るり。"]
}
, {kind:"K", lines:["ほしをみる。はなをつむ。さけをのむ。ふえをふく。みちをゆく。"]
}
, {kind:"I", lines:["最後にスピード練習で、このレッスンは終わり。"]
}
, {kind:"Q", lines:["はたを、ふる。いろを、ぬる。つちを、ほる。さらを、わる。むりを、いう。", "かたを、たたく。こしを、さする。かねを、ひろう。おゆを、さます。"]
}
]
, keytype:"k", num:"13"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K13", "", "", "このレッスンでは、新しく「を」「ろ」および句読点「、」「。」の練習をし", "ます。", ""]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["れけむ  れほへ  ちたぬ  ちぬた  れせへ  けむれ", "つちぬ  めれむ  れへほ  たぬち  せほへ  れむけ"]
}
, {kind:"K", lines:["そのさむらいは  てきへいの  わな  みぬき  ひそかに  ぬけみちへ", "へいそから  ていけつあつの  むすめ  おきぬけは  まぬけな  かお"]
}
, {kind:"T", lines:["                        左のシフトキー", "", "このレッスンの「を」や句読点、あとのレッスンで練習する促音や拗音の小さな", "字は、シフトキーを押しながら入力する必要があります。", "右手側にある文字を左シフトキーを押しながら入力するには:", "", "        1. Aの指を左シフトキーの上に移動させて押します。この時、右人差し", "           指はできるだけFの上から動かさないように心がけます。", "", "        2. 右手で目的のキーを押します。", "", "        3. Aの指は素早くホームポジションに戻します。"]
}
, {kind:"I", lines:["「を」は左シフトキーを押しながら、右小指で0（ゼロ）を押します。"]
}
, {kind:"K", lines:["れれれ  ををを  れれれ  ををを  れれ  をを  れを  をれ"]
}
, {kind:"I", lines:["「を」を押したら、左右の小指はホームポジションに戻します。"]
}
, {kind:"K", lines:["ちれを  たちせれを  つちめれを  ちけれを", "けむちを  つけを  むたを  ちせを  ためを"]
}
, {kind:"K", lines:["とをあける  うたをうたう  いぬをかう  こいをする  ゆめをみる"]
}
, {kind:"K", lines:["ふくをきる  くつをはく  かおをあらう  ほんをかう  かさをさす"]
}
, {kind:"I", lines:["「ろ」は右シフトキーの隣の「\\」（バックスラッシュ）を小指で押します。"]
}
, {kind:"K", lines:["れれれ  ろろろ  れれれ  ろろろ  れれ  ろろ  れろ  ろれ"]
}
, {kind:"I", lines:["「ろ」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["れろれろ  れけれけ  れろれろ  れめれめ  れろれろ", "れけろ  れめろ  けろれ  けれろ  ろれめ  ろけれ"]
}
, {kind:"K", lines:["ひろんりてきな  ろんしに  ろんそうあいての  おろかさ  ろてい"]
}
, {kind:"I", lines:["読点「、」は左シフトキーを押しながら、右中指で「,」を押します。"]
}
, {kind:"K", lines:["ののの  、、、  ののの  、、、  のの  、、  の、  、の"]
}
, {kind:"I", lines:["「、」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["の、の、  のねのね  の、の、  のにのに  の、の、", "の、に  のに、  のにゆ  、のに  、のゆ  のに、"]
}
, {kind:"K", lines:["ろくおんしたのに、さいせい、うまくいかない、るすろくも、おかしい"]
}
, {kind:"I", lines:["句点「。」は左シフトキーを押しながら、右薬指で「.」を押します。"]
}
, {kind:"K", lines:["りりり  。。。  りりり  。。。  りり  。。  り。  。り"]
}
, {kind:"I", lines:["「。」を押したら、指はホームポジションに戻します。"]
}
, {kind:"K", lines:["り。り。  りるりる  り。り。  りらりら  り。り。", "り。る  りら。  る。り  。るら  りら。  るり。"]
}
, {kind:"K", lines:["ほしをみる。はなをつむ。さけをのむ。ふえをふく。みちをゆく。"]
}
, {kind:"I", lines:["最後にスピード練習で、このレッスンは終わり。"]
}
, {kind:"Q", lines:["はたを、ふる。いろを、ぬる。つちを、ほる。さらを、わる。むりを、いう。", "かたを、たたく。こしを、さする。かねを、ひろう。おゆを、さます。"]
}
]
, keytype:"j", num:"13"}
, {course:"k", data:[{kind:"T", lines:["                        かな入力コースへようこそ.", "", "Kコースのレッスンでは、かな入力方式のタッチタイピングを学習します。", "キーボード上の各文字を各レッスンで少しずつ紹介してゆきますが、このコース", "を終わった時には、かな入力で日本語のタイプができるようになっていることで", "しょう。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "タイプする時にキーの上の指を見ることは避けましょう。これは大変悪い習慣で、", "なかなか上達できません。このプログラムでは、誤ったキーインは画面上でそれ", "とわかるように表示します。", "", "あなたがこれまで、目で見てキーを押す方法でやって来たのなら、見ないで打つ", "のはちょっと苦労かもしれません。タッチタイピングがこれまでの方法より遅い", "としても、がっかりしないで下さい。一度この方法を身につけてしまえば、遥か", "に速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        かな入力 vs. ローマ字入力", "", "日本語の入力方式には、かな入力とローマ字入力があります。かな入力は、キー", "ボードの表面（キートップ）に書かれたかな文字をそのまま入力するものです。", "一方、ローマ字入力は、アルファベットでローマ字を入力することによって日本", "語を入力します。", "どちらの方式がよいのか、単純に判断はできませんが、かな入力をローマ字入力", "と比較した場合、以下のような長所、短所があります。", "", "長所 - かな一文字が１回のタイプで入力できるため、入力速度が早い。", "     - 入力時にローマ字を思い浮かべる必要がない。", "短所 - かな用、アルファベット用にタイプ練習をしなければならない。", "     - 覚えなければならないキーの数が多い。", "     - 計算機の機種によって、かな文字のキー配置が異なることがある。", "", "もしあなたが、英文やプログラムの入力も行うのであれば、ローマ字入力で十分", "ではないでしょうか。", "日本語のタイプに専念する人、ローマ字入力では入力速度が遅いと不満を持って", "いる人は、かな入力をマスターすることに意義があるでしょう。"]
}
, {kind:"T", lines:["                        かな漢字変換について", "", "タイプした文字を漢字やカタカナに変換して入力するには、フロントエンド・プ", "ロセッサ(FEP)と呼ばれるプログラムを利用します。", "変換の方法はFEPごとに異なっていますので、ここでは触れません。このコース", "では、かな文字のタッチタイピングの方法だけを練習します。", "", "Typistで練習する時は、FEPを使う必要はありません。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、101キーボードの設定で動作しています。", "", "このキーボードでは、改行キーの近くに '[' と ']' が隣り合って配置され、数", "字の '2' とシフトキーで '@' が入力できるはずです。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード（JISに準拠）", "        -ke     101キーボード（主に国外メーカ）", "        -kk     国産パソコンのキーボード", "", "例えば、106キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -kj", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        ホームキー", "", "指先で触っただけで正しくキー入力できるためには、指がどこにあるのかを常に", "知っていなければなりません。このために、各指をそれぞれ特定の位置に置くよ", "うにします。このキー位置を「ホームポジション」と呼びます。", "", "右の人差し指をJのキーの上に置きます。中指はK、薬指はL、小指は;のキーの上", "に置きます。", "", "同様にして、左手はF、D、S、Aのキーの上に指を置きます。右の親指はスペース", "バーの上に置きます。スペースは常に右か左の親指で打って下さい。", "次に、全部の指を軽く浮かせて、キーの真上で構えた状態にします。各指はわず", "かにホームキーの表面に触れるようにします。計算機のキーボードは、タイプす", "る時にあまり強く力をかける必要はありません。", "", "一行何かを入力しようとする時には、まず各指がホームポジションにあることを", "確認して下さい。それ以降は指を見てはいけません。キーボードによっては、", "JとF、あるいはKとDに、指で触ってわかるように、突起があったり、湾曲が深く", "なっていたりするものもあります。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "この後のレッスンでは、画面の中ほどにテキストを１行表示し、画面の上の方に", "指示を表示します。", "", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "", "行末まで打ち終えたら、改行(Return)キーを打ちます。これは、右の小指を伸ば", "して打ちます。キーを打ったら、指を素早くホームポジションに戻します。この", "途中で指がホームポジションから離れてしまわないように注意して下さい。", "また、行末で余分な空白を入力しないように気を付けて下さい。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。２回目の挑戦で２個以上間違えるともう一回やり直し、というふう", "になっています。右の親指をスペースバーの上に置くことを忘れないように。"]
}
, {kind:"I", lines:["まず、「は」です。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"K", lines:["はははは"]
}
, {kind:"I", lines:["Fのキーとスペースバーを交互に打ちます。"]
}
, {kind:"K", lines:["ははは  ははは  ははは  はは  はは  はは  は  は"]
}
, {kind:"B", lines:["指先を見てはいけません！"]
}
, {kind:"I", lines:["「ま」はJのキーを右人差し指で打ちます。"]
}
, {kind:"K", lines:["ままま  ままま  ままま  まま  まま  まま  ま  ま"]
}
, {kind:"I", lines:["左人差し指を「は」に、右人差し指を「ま」に使います。"]
}
, {kind:"K", lines:["ははは  ままま  ははは  ままま  はは  まま  はは  まま  は  ま"]
}
, {kind:"I", lines:["レッスン1はこれで終わりにしましょう。"]
}
, {kind:"K", lines:["ははまま  ままはは  はまは  まはま  はまは  まはま"]
}
]
, keytype:"e", num:"1"}
, {course:"k", data:[{kind:"T", lines:["                        かな入力コースへようこそ.", "", "Kコースのレッスンでは、かな入力方式のタッチタイピングを学習します。", "キーボード上の各文字を各レッスンで少しずつ紹介してゆきますが、このコース", "を終わった時には、かな入力で日本語のタイプができるようになっていることで", "しょう。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "タイプする時にキーの上の指を見ることは避けましょう。これは大変悪い習慣で、", "なかなか上達できません。このプログラムでは、誤ったキーインは画面上でそれ", "とわかるように表示します。", "", "あなたがこれまで、目で見てキーを押す方法でやって来たのなら、見ないで打つ", "のはちょっと苦労かもしれません。タッチタイピングがこれまでの方法より遅い", "としても、がっかりしないで下さい。一度この方法を身につけてしまえば、遥か", "に速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        かな入力 vs. ローマ字入力", "", "日本語の入力方式には、かな入力とローマ字入力があります。かな入力は、キー", "ボードの表面（キートップ）に書かれたかな文字をそのまま入力するものです。", "一方、ローマ字入力は、アルファベットでローマ字を入力することによって日本", "語を入力します。", "どちらの方式がよいのか、単純に判断はできませんが、かな入力をローマ字入力", "と比較した場合、以下のような長所、短所があります。", "", "長所 - かな一文字が１回のタイプで入力できるため、入力速度が早い。", "     - 入力時にローマ字を思い浮かべる必要がない。", "短所 - かな用、アルファベット用にタイプ練習をしなければならない。", "     - 覚えなければならないキーの数が多い。", "     - 計算機の機種によって、かな文字のキー配置が異なることがある。", "", "もしあなたが、英文やプログラムの入力も行うのであれば、ローマ字入力で十分", "ではないでしょうか。", "日本語のタイプに専念する人、ローマ字入力では入力速度が遅いと不満を持って", "いる人は、かな入力をマスターすることに意義があるでしょう。"]
}
, {kind:"T", lines:["                        かな漢字変換について", "", "タイプした文字を漢字やカタカナに変換して入力するには、フロントエンド・プ", "ロセッサ(FEP)と呼ばれるプログラムを利用します。", "変換の方法はFEPごとに異なっていますので、ここでは触れません。このコース", "では、かな文字のタッチタイピングの方法だけを練習します。", "", "Typistで練習する時は、FEPを使う必要はありません。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、国産パソコンのキーボード設定で動作しています。", "", "このキーボードでは、「カナ」キーを押すことによって半角カタカナが入力でき", "るはずです。主に国産パソコンの MS-DOSで Typistを使う場合にこの設定で使用", "します（かな入力の練習をしない場合は日本語106キーボードの設定でも、特に", "問題ありません）。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード（JISに準拠）", "        -ke     101キーボード（主に国外メーカ）", "        -kk     国産パソコンのキーボード", "", "例えば、106キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -kj", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        ホームキー", "", "指先で触っただけで正しくキー入力できるためには、指がどこにあるのかを常に", "知っていなければなりません。このために、各指をそれぞれ特定の位置に置くよ", "うにします。このキー位置を「ホームポジション」と呼びます。", "", "右の人差し指をJのキーの上に置きます。中指はK、薬指はL、小指は;のキーの上", "に置きます。", "", "同様にして、左手はF、D、S、Aのキーの上に指を置きます。右の親指はスペース", "バーの上に置きます。スペースは常に右か左の親指で打って下さい。", "次に、全部の指を軽く浮かせて、キーの真上で構えた状態にします。各指はわず", "かにホームキーの表面に触れるようにします。計算機のキーボードは、タイプす", "る時にあまり強く力をかける必要はありません。", "", "一行何かを入力しようとする時には、まず各指がホームポジションにあることを", "確認して下さい。それ以降は指を見てはいけません。キーボードによっては、", "JとF、あるいはKとDに、指で触ってわかるように、突起があったり、湾曲が深く", "なっていたりするものもあります。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "この後のレッスンでは、画面の中ほどにテキストを１行表示し、画面の上の方に", "指示を表示します。", "", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "", "行末まで打ち終えたら、改行(Return)キーを打ちます。これは、右の小指を伸ば", "して打ちます。キーを打ったら、指を素早くホームポジションに戻します。この", "途中で指がホームポジションから離れてしまわないように注意して下さい。", "また、行末で余分な空白を入力しないように気を付けて下さい。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。２回目の挑戦で２個以上間違えるともう一回やり直し、というふう", "になっています。右の親指をスペースバーの上に置くことを忘れないように。"]
}
, {kind:"I", lines:["まず、「は」です。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"K", lines:["はははは"]
}
, {kind:"I", lines:["Fのキーとスペースバーを交互に打ちます。"]
}
, {kind:"K", lines:["ははは  ははは  ははは  はは  はは  はは  は  は"]
}
, {kind:"B", lines:["指先を見てはいけません！"]
}
, {kind:"I", lines:["「ま」はJのキーを右人差し指で打ちます。"]
}
, {kind:"K", lines:["ままま  ままま  ままま  まま  まま  まま  ま  ま"]
}
, {kind:"I", lines:["左人差し指を「は」に、右人差し指を「ま」に使います。"]
}
, {kind:"K", lines:["ははは  ままま  ははは  ままま  はは  まま  はは  まま  は  ま"]
}
, {kind:"I", lines:["レッスン1はこれで終わりにしましょう。"]
}
, {kind:"K", lines:["ははまま  ままはは  はまは  まはま  はまは  まはま"]
}
]
, keytype:"k", num:"1"}
, {course:"k", data:[{kind:"T", lines:["                        かな入力コースへようこそ.", "", "Kコースのレッスンでは、かな入力方式のタッチタイピングを学習します。", "キーボード上の各文字を各レッスンで少しずつ紹介してゆきますが、このコース", "を終わった時には、かな入力で日本語のタイプができるようになっていることで", "しょう。", "", "これまでにタイプの練習をしたことがない人でも、心配は無用です。タイピング", "は、練習にこそ多くの時間を必要としますが、難しいものではないのです。", "タイプする時にキーの上の指を見ることは避けましょう。これは大変悪い習慣で、", "なかなか上達できません。このプログラムでは、誤ったキーインは画面上でそれ", "とわかるように表示します。", "", "あなたがこれまで、目で見てキーを押す方法でやって来たのなら、見ないで打つ", "のはちょっと苦労かもしれません。タッチタイピングがこれまでの方法より遅い", "としても、がっかりしないで下さい。一度この方法を身につけてしまえば、遥か", "に速く入力できるようになるのですから。"]
}
, {kind:"T", lines:["                        かな入力 vs. ローマ字入力", "", "日本語の入力方式には、かな入力とローマ字入力があります。かな入力は、キー", "ボードの表面（キートップ）に書かれたかな文字をそのまま入力するものです。", "一方、ローマ字入力は、アルファベットでローマ字を入力することによって日本", "語を入力します。", "どちらの方式がよいのか、単純に判断はできませんが、かな入力をローマ字入力", "と比較した場合、以下のような長所、短所があります。", "", "長所 - かな一文字が１回のタイプで入力できるため、入力速度が早い。", "     - 入力時にローマ字を思い浮かべる必要がない。", "短所 - かな用、アルファベット用にタイプ練習をしなければならない。", "     - 覚えなければならないキーの数が多い。", "     - 計算機の機種によって、かな文字のキー配置が異なることがある。", "", "もしあなたが、英文やプログラムの入力も行うのであれば、ローマ字入力で十分", "ではないでしょうか。", "日本語のタイプに専念する人、ローマ字入力では入力速度が遅いと不満を持って", "いる人は、かな入力をマスターすることに意義があるでしょう。"]
}
, {kind:"T", lines:["                        かな漢字変換について", "", "タイプした文字を漢字やカタカナに変換して入力するには、フロントエンド・プ", "ロセッサ(FEP)と呼ばれるプログラムを利用します。", "変換の方法はFEPごとに異なっていますので、ここでは触れません。このコース", "では、かな文字のタッチタイピングの方法だけを練習します。", "", "Typistで練習する時は、FEPを使う必要はありません。"]
}
, {kind:"T", lines:["                        キーボードの設定", "", "現在、106キーボードの設定で動作しています。", "", "このキーボードでは、改行キーの近くに '[' と ']' が縦に並んで配置され、数", "字の '2' とシフトキーで '\"' が入力できるはずです。", "そうでない場合、キーボードのタイプを -k オプションで指定して、 Typistを", "起動し直す必要があります。", "", "        -kj     106キーボード（JISに準拠）", "        -ke     101キーボード（主に国外メーカ）", "        -kk     国産パソコンのキーボード", "", "例えば、101キーボードの設定にするには、次のようなコマンドで起動します。", "        typist -ke", "この設定は一回行えば、設定用ファイルに記録されますので、次回からは指定す", "る必要はありません。", "", "今すぐ Typist を終了したい場合には、Control-C を入力して下さい。"]
}
, {kind:"T", lines:["                        ホームキー", "", "指先で触っただけで正しくキー入力できるためには、指がどこにあるのかを常に", "知っていなければなりません。このために、各指をそれぞれ特定の位置に置くよ", "うにします。このキー位置を「ホームポジション」と呼びます。", "", "右の人差し指をJのキーの上に置きます。中指はK、薬指はL、小指は;のキーの上", "に置きます。", "", "同様にして、左手はF、D、S、Aのキーの上に指を置きます。右の親指はスペース", "バーの上に置きます。スペースは常に右か左の親指で打って下さい。", "次に、全部の指を軽く浮かせて、キーの真上で構えた状態にします。各指はわず", "かにホームキーの表面に触れるようにします。計算機のキーボードは、タイプす", "る時にあまり強く力をかける必要はありません。", "", "一行何かを入力しようとする時には、まず各指がホームポジションにあることを", "確認して下さい。それ以降は指を見てはいけません。キーボードによっては、", "JとF、あるいはKとDに、指で触ってわかるように、突起があったり、湾曲が深く", "なっていたりするものもあります。"]
}
, {kind:"T", lines:["                        練習の仕方", "", "この後のレッスンでは、画面の中ほどにテキストを１行表示し、画面の上の方に", "指示を表示します。", "", "あなたがすべきことは、画面の中ほどに表示されたテキストの文字をタイプする", "ことです。正しい文字を入力した時には特に何もしません。誤った場合には、大", "文字のXを表示し、音を出します。正しくても間違っていても、とにかくタイプを", "続けて下さい。Deleteキーは使えません。", "", "行末まで打ち終えたら、改行(Return)キーを打ちます。これは、右の小指を伸ば", "して打ちます。キーを打ったら、指を素早くホームポジションに戻します。この", "途中で指がホームポジションから離れてしまわないように注意して下さい。", "また、行末で余分な空白を入力しないように気を付けて下さい。", "", "誤りなくその行をタイプできたら、次の練習用パターンが表示されます。間違え", "てタイプした場合には、音で知らせ、同じ行をもう一度やりなおしてもらうこと", "になります。２回目の挑戦で２個以上間違えるともう一回やり直し、というふう", "になっています。右の親指をスペースバーの上に置くことを忘れないように。"]
}
, {kind:"I", lines:["まず、「は」です。Fのキーを左人差し指で４回打って下さい。"]
}
, {kind:"K", lines:["はははは"]
}
, {kind:"I", lines:["Fのキーとスペースバーを交互に打ちます。"]
}
, {kind:"K", lines:["ははは  ははは  ははは  はは  はは  はは  は  は"]
}
, {kind:"B", lines:["指先を見てはいけません！"]
}
, {kind:"I", lines:["「ま」はJのキーを右人差し指で打ちます。"]
}
, {kind:"K", lines:["ままま  ままま  ままま  まま  まま  まま  ま  ま"]
}
, {kind:"I", lines:["左人差し指を「は」に、右人差し指を「ま」に使います。"]
}
, {kind:"K", lines:["ははは  ままま  ははは  ままま  はは  まま  はは  まま  は  ま"]
}
, {kind:"I", lines:["レッスン1はこれで終わりにしましょう。"]
}
, {kind:"K", lines:["ははまま  ままはは  はまは  まはま  はまは  まはま"]
}
]
, keytype:"j", num:"1"}
, {course:"k", data:[{kind:"T", lines:["                             Lesson K4", "", "", "このレッスンでは、新しく「な」「す」「ね」および「そ」の練習をします。", "", "これらの文字のために指を伸ばしても、必ずホームポジションに戻るようにして", "下さい。指先を見てはいけません。"]
}
, {kind:"I", lines:["まず復習から。"]
}
, {kind:"K", lines:["ははは  ままま  ききき  くくく  ししし  ののの  いいい  ににに", "はきはき  まくまく  しいしい  のにのに  とりとり  ちれちれ"]
}
, {kind:"K", lines:["りくの  きちは  しはいちいきの  ききいしき  はいし  いいはれ", "くまの  しいく  まいにち  しきりに  まちに  にく  しいれにいく"]
}
, {kind:"I", lines:["「な」はUのキーで、Jに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ままま  ななな  ままま  ななな  まま  なな  まな  なま"]
}
, {kind:"K", lines:["ままま  ななな  まなま  なまな  のにの  にのに", "となり  なにの  はな  なのはな  きれいな  はな"]
}
, {kind:"I", lines:["「す」はRのキーで、Fに置いている人差し指を使います。"]
}
, {kind:"K", lines:["ははは  すすす  ははは  すすす  はは  すす  はす  すは"]
}
, {kind:"K", lines:["ははは  すすす  はすは  すはす  しいし  すはす", "くりすます  すくない  すいすの  くすりは  きく"]
}
, {kind:"I", lines:["「ね」は「<」のキーで、Kに置いている中指を使います。"]
}
, {kind:"K", lines:["ののの  ねねね  ののの  ねねね  のの  ねね  のね  ねの"]
}
, {kind:"K", lines:["ののの  ねねね  のにの  のねの  にのに  ねのね", "ねりまの  にのまい  しねまの  まね  なのにね"]
}
, {kind:"I", lines:["「そ」はCのキーで、Dに置いている中指を使います。"]
}
, {kind:"K", lines:["ししし  そそそ  ししし  そそそ  しし  そそ  しそ  そし"]
}
, {kind:"K", lines:["ししし  そそそ  しそし  しいし  そしそ  いそいそ", "そしきの  きそく  その  そしな  いその  しきそ"]
}
, {kind:"I", lines:["全部一緒に。"]
}
, {kind:"K", lines:["なすねそね  なすそすそ  なねなすね  そすそねな", "なそますと  そすねなは  のしすりそ  ますとそす"]
}
, {kind:"I", lines:["おしまいに、例によって意味のない単語を。"]
}
, {kind:"K", lines:["すくない  りそく  くれない  それとなく  とくそく  しますね", "その  そしきない  ねいすに  ねとまり  ますます  すとれす"]
}
]
, keytype:"ejk", num:"4"}
]
;
