if (!this["Typist_lesson_data"]) Typist_lesson_data = {};
Typist_lesson_data["n"] = [{course:"n", data:[{kind:"T", lines:["                        数字キー入力コース", "", "Nコースのレッスンでは、数字キー（いわゆるテンキー、あるいは電卓キー）が利", "用できる端末から数字を入力する練習を行います。テンキーのタッチタイピングを", "練習するにあたり、通常のキーボードでどのように入力するかという知識は必要あ", "りません。従って、このコースはこれから直ちに開始できるのです。", "", "数値を入力する時、普通はスピードよりも正確さが重要です。以下のレッスンはゆっ", "くり行って下さい。スピードはあとからだんだんとついてくるものです。", "", "通常のテンキーの場合、まず「ホームポジション」から始めなければなりません。", "右の人差し指、中指、薬指をそれぞれ4、5、6のキーの上に置いて下さい（親指と", "小指は使いません）。指はキーの表面に軽く触れるように構えます。左手の親指、", "あるいは他の指はスペースバーなどの他のキーのために使います。", "", "各行を入力し終わったら、6の指（右の薬指）で Enterキーを打ちます。指は素早く", "6のキーの上に戻します。指を見ることなく戻すということが大変重要です。"]
}
, {kind:"I", lines:["薬指だけで."]
}
, {kind:"D", lines:["666666"]
}
, {kind:"I", lines:["5には中指を使います."]
}
, {kind:"D", lines:["6565656"]
}
, {kind:"I", lines:["4には人差し指を使います."]
}
, {kind:"D", lines:["666444555444666"]
}
, {kind:"I", lines:["さあ、何行かタイプしてみましょう."]
}
, {kind:"P", lines:["666444666", "444555666", "555444555", "666444666", "646464646", "656565656", "445566555", "456456456"]
}
, {kind:"I", lines:["ピリオドには薬指（あるいは中指）を使います."]
}
, {kind:"D", lines:["555...555"]
}
, {kind:"P", lines:["5.54.45.56.6", "444.555", "45.56.6", "64.65.4", "54.65.4"]
}
, {kind:"I", lines:["ピリオドには薬指（あるいは中指）を使います."]
}
, {kind:"P", lines:["445566.654", "654456.546", "546546.564", "554466.645", "555444.666"]
}
, {kind:"I", lines:["1には人差し指を."]
}
, {kind:"D", lines:["444111444.444111444"]
}
, {kind:"P", lines:["111.444", "414.141", "456.546", "415.164", "541.146"]
}
, {kind:"I", lines:["これまで練習したキーの復習です."]
}
, {kind:"D", lines:["444555666111...555444666111"]
}
, {kind:"P", lines:["414.564", "546.145", "546.145", "644.146", "615.645", "564.145", "546.164", "111.555", "514.651"]
}
]
, keytype:"ejk", num:"1"}
, {course:"n", data:[{kind:"I", lines:["はじめに、全部の数字の復習です."]
}
, {kind:"D", lines:["1234567890.0987654321"]
}
, {kind:"D", lines:["12.34.56.78.90.10.29.38.47.57"]
}
, {kind:"P", lines:["123.654", "212.658", "908.000", "285.080", "288.381", "398.813", "286.187", "924.156", "684.028", "354.459", "321.840"]
}
, {kind:"I", lines:["数字の復習です."]
}
, {kind:"P", lines:["12345", "35840", "25874", "93682", "71489", "31265", "97824", "28617", "39715", "17935", "28460", "52846", "28469"]
}
, {kind:"I", lines:[""]
}
, {kind:"P", lines:["1.00", "2.05", "3.50", "4.52", "5.81", "6.95", "7.00", "8.45", "9.50"]
}
, {kind:"I", lines:[""]
}
, {kind:"P", lines:["879.359", "286.498", "357.159", "654.852", "159.357", "571.392", "284.293", "231.879"]
}
, {kind:"I", lines:[""]
}
, {kind:"P", lines:["100.200", "258.246", "369.741", "123.987", "582.714", "239.900", "273.194", "372.973"]
}
, {kind:"I", lines:["スペースバーには、左のどれかの指を使います."]
}
, {kind:"D", lines:["111 222 333 444 555 666 777 888 999 000"]
}
, {kind:"P", lines:["123 654 879 264", "128 364 928 187", "987 234 681 287", "357 159 671 077", "350 950 137 940", "320 487 364 197"]
}
, {kind:"I", lines:[""]
}
, {kind:"P", lines:["82.01 35", "28.50 12", "50.00 79", "40.25 37", "82.50 19", "99.95 61", "12.95 87", "40.00 55", "64.50 99"]
}
]
, keytype:"ejk", num:"3"}
, {course:"n", data:[{kind:"I", lines:["最初に、レッスン１のキーの復習です."]
}
, {kind:"D", lines:["444.555.666.111.6541.6541"]
}
, {kind:"I", lines:["2には中指を使います."]
}
, {kind:"D", lines:["555222555.525.525.525"]
}
, {kind:"P", lines:["45.25", "52.52", "62.62", "22.22", "51.12", "12.52", "24.42"]
}
, {kind:"I", lines:["3には薬指を使います."]
}
, {kind:"D", lines:["666333666.636.636"]
}
, {kind:"P", lines:["456.123", "321.654", "666.333", "323.353", "343.313", "353.363", "313.434"]
}
, {kind:"I", lines:["3には薬指を使います."]
}
, {kind:"P", lines:["12.33", "45.33", "65.35", "12.35", "65.25", "25.63", "43.53", "13.36", "34.31"]
}
, {kind:"I", lines:["ゼロには人差し指（あるいは親指）を."]
}
, {kind:"D", lines:["444000444.401.410"]
}
, {kind:"D", lines:["410.020.030.040.060.104"]
}
, {kind:"P", lines:["12.00", "23.00", "51.50", "46.25", "54.00", "13.04"]
}
, {kind:"I", lines:["8には中指を使います."]
}
, {kind:"D", lines:["555888555.852.258"]
}
, {kind:"D", lines:["585.080.808.818.282"]
}
, {kind:"P", lines:["81.05", "84.80", "88.88", "58.28", "80.18", "28.38"]
}
, {kind:"I", lines:["9には薬指を."]
}
, {kind:"D", lines:["666999666.393.696"]
}
, {kind:"D", lines:["595.989.696.393.295"]
}
, {kind:"P", lines:[".91", ".90", ".94", ".95", ".96", ".93", ".90", ".95"]
}
, {kind:"I", lines:["最後は7です。人差し指を使います."]
}
, {kind:"D", lines:["444777444.0147.7410"]
}
, {kind:"D", lines:["767.737.797.727.707.717"]
}
, {kind:"D", lines:["1234567890.1234567890"]
}
, {kind:"P", lines:["17.19", "71.70", "19.37", "57.07", "71.37", "27.72", "37.73", "76.67", "45.17", "70.07"]
}
, {kind:"I", lines:["最後です."]
}
, {kind:"P", lines:["75856", "87237", "21570", "24870", "47258", "21573", "21573", "21584", "35827"]
}
]
, keytype:"ejk", num:"2"}
]
;
